[Survived] StringLiteral
src/lib/checker.js:11:39
 import { parseDOI } from './doi-validator.js';
 
 // Initialize module logger
-const log = logger.createScopedLogger('checker');
+const log = logger.createScopedLogger("");
 
 // Default settings for DOI checking

[Survived] BooleanLiteral
src/lib/checker.js:19:20
   timeout: 10000, // 10 seconds
   maxRetries: 3,
   retryDelay: 1000, // 1 second
-  followRedirects: true
+  followRedirects: false
 };
 

[NoCoverage] BlockStatement
src/lib/checker.js:27:26
  * @param {number} ms - Time to wait in milliseconds
  * @returns {Promise<void>}
  */
-async function sleep(ms) {
-  return new Promise(resolve => setTimeout(resolve, ms));
-}
+async function sleep(ms) {}
 
 /**

[NoCoverage] ArrowFunction
src/lib/checker.js:28:22
  * @returns {Promise<void>}
  */
 async function sleep(ms) {
-  return new Promise(resolve => setTimeout(resolve, ms));
+  return new Promise(() => undefined);
 }
 

[NoCoverage] ConditionalExpression
src/lib/checker.js:51:12
     let retries = 0;
     let lastError = null;
     
-    while (retries <= checkOptions.maxRetries) {
+    while (false) {
       try {
         if (retries > 0) {

[NoCoverage] EqualityOperator
src/lib/checker.js:51:12
     let retries = 0;
     let lastError = null;
     
-    while (retries <= checkOptions.maxRetries) {
+    while (retries < checkOptions.maxRetries) {
       try {
         if (retries > 0) {

[NoCoverage] EqualityOperator
src/lib/checker.js:53:13
     
     while (retries <= checkOptions.maxRetries) {
       try {
-        if (retries > 0) {
+        if (retries <= 0) {
           log.debug(`Retry ${retries}/${checkOptions.maxRetries} for DOI: ${doi}`);
           await sleep(checkOptions.retryDelay);

[NoCoverage] EqualityOperator
src/lib/checker.js:53:13
     
     while (retries <= checkOptions.maxRetries) {
       try {
-        if (retries > 0) {
+        if (retries >= 0) {
           log.debug(`Retry ${retries}/${checkOptions.maxRetries} for DOI: ${doi}`);
           await sleep(checkOptions.retryDelay);

[NoCoverage] StringLiteral
src/lib/checker.js:54:21
     while (retries <= checkOptions.maxRetries) {
       try {
         if (retries > 0) {
-          log.debug(`Retry ${retries}/${checkOptions.maxRetries} for DOI: ${doi}`);
+          log.debug(``);
           await sleep(checkOptions.retryDelay);
         }

[NoCoverage] ObjectLiteral
src/lib/checker.js:58:46
           await sleep(checkOptions.retryDelay);
         }
         
-        const response = await fetch(doiUrl, {
-          method: 'HEAD', // Use HEAD to avoid downloading full content
-          redirect: checkOptions.followRedirects ? 'follow' : 'manual',
-          headers: {
-            'User-Agent': checkOptions.userAgent
-          },
-          cf: {
-            timeout: checkOptions.timeout
-          }
-        });
+        const response = await fetch(doiUrl, {});
 
         const finalResponse = await fetch(response.url, {

[NoCoverage] ObjectLiteral
src/lib/checker.js:69:57
           }
         });
 
-        const finalResponse = await fetch(response.url, {
-          method: 'HEAD', // Ensure we get the final URL after redirects
-          redirect: checkOptions.followRedirects ? 'follow' : 'manual',
-          headers: {
-            'User-Agent': checkOptions.userAgent
-          },
-          cf: {
-            timeout: checkOptions.timeout
-          }
-        });
+        const finalResponse = await fetch(response.url, {});
         
         // working: don't need to get a 20x response, just need to know if the DOI resolves

[NoCoverage] ObjectLiteral
src/lib/checker.js:82:24
         
         // working: don't need to get a 20x response, just need to know if the DOI resolves
         // Consider any 2xx, 3xx, or 4xx (except 404) as "resolves"
-        const result = {
-          doi: doi,
-          working: response.status !== 404,
-          httpStatus: finalResponse.status,
-          finalUrl: response.url,
-          timestamp: new Date().toISOString()
-        };
+        const result = {};
         
         log.debug(`DOI check result: ${doi}`, { 

[NoCoverage] ConditionalExpression
src/lib/checker.js:84:20
         // Consider any 2xx, 3xx, or 4xx (except 404) as "resolves"
         const result = {
           doi: doi,
-          working: response.status !== 404,
+          working: true,
           httpStatus: finalResponse.status,
           finalUrl: response.url,

[NoCoverage] ConditionalExpression
src/lib/checker.js:84:20
         // Consider any 2xx, 3xx, or 4xx (except 404) as "resolves"
         const result = {
           doi: doi,
-          working: response.status !== 404,
+          working: false,
           httpStatus: finalResponse.status,
           finalUrl: response.url,

[NoCoverage] ObjectLiteral
src/lib/checker.js:90:47
           timestamp: new Date().toISOString()
         };
         
-        log.debug(`DOI check result: ${doi}`, { 
-          status: response.status, 
-          working: result.working 
-        });
+        log.debug(`DOI check result: ${doi}`, {});
         
         return result;

[NoCoverage] BlockStatement
src/lib/checker.js:96:23
         });
         
         return result;
-      } catch (error) {
-        lastError = error;
-        retries++;
-        log.warn(`Error checking DOI ${doi} (attempt ${retries})`, { 
-          error: error.message 
-        });
-      }
+      } catch (error) {}
     }
     

[NoCoverage] UpdateOperator
src/lib/checker.js:98:9
         return result;
       } catch (error) {
         lastError = error;
-        retries++;
+        retries--;
         log.warn(`Error checking DOI ${doi} (attempt ${retries})`, { 
           error: error.message 

[NoCoverage] ObjectLiteral
src/lib/checker.js:99:68
       } catch (error) {
         lastError = error;
         retries++;
-        log.warn(`Error checking DOI ${doi} (attempt ${retries})`, { 
-          error: error.message 
-        });
+        log.warn(`Error checking DOI ${doi} (attempt ${retries})`, {});
       }
     }

[NoCoverage] ObjectLiteral
src/lib/checker.js:106:87
     }
     
     // If we've exhausted all retries
-    log.error(`Failed to check DOI after ${checkOptions.maxRetries} retries: ${doi}`, {
-      error: lastError?.message
-    });
+    log.error(`Failed to check DOI after ${checkOptions.maxRetries} retries: ${doi}`, {});
     
     return {

[NoCoverage] OptionalChaining
src/lib/checker.js:107:14
     
     // If we've exhausted all retries
     log.error(`Failed to check DOI after ${checkOptions.maxRetries} retries: ${doi}`, {
-      error: lastError?.message
+      error: lastError.message
     });
     

[NoCoverage] BooleanLiteral
src/lib/checker.js:112:16
     
     return {
       doi: doi,
-      working: false,
+      working: true,
       httpStatus: null,
       error: lastError?.message || 'Unknown error',

[NoCoverage] ConditionalExpression
src/lib/checker.js:114:14
       doi: doi,
       working: false,
       httpStatus: null,
-      error: lastError?.message || 'Unknown error',
+      error: false,
       timestamp: new Date().toISOString()
     };

[NoCoverage] LogicalOperator
src/lib/checker.js:114:14
       doi: doi,
       working: false,
       httpStatus: null,
-      error: lastError?.message || 'Unknown error',
+      error: lastError?.message && 'Unknown error',
       timestamp: new Date().toISOString()
     };

[NoCoverage] BlockStatement
src/lib/checker.js:118:19
       timestamp: new Date().toISOString()
     };
     
-  } catch (error) {
-    log.error(`Error processing DOI check: ${doi}`, { error: error.message });
-    
-    return {
-      doi: doi,
-      working: false,
-      httpStatus: null,
-      error: error.message,
-      timestamp: new Date().toISOString()
-    };
-  }
+  } catch (error) {}
 }
 

[NoCoverage] ObjectLiteral
src/lib/checker.js:119:53
     };
     
   } catch (error) {
-    log.error(`Error processing DOI check: ${doi}`, { error: error.message });
+    log.error(`Error processing DOI check: ${doi}`, {});
     
     return {

[NoCoverage] BooleanLiteral
src/lib/checker.js:138:19
  * @returns {Promise<Object[]>} - Array of check results
  */
 export async function checkMultipleDOIs(doiList, options = {}) {
-  if (!doiList || !Array.isArray(doiList)) {
+  if (!doiList || Array.isArray(doiList)) {
     log.warn('Invalid DOI list provided', { doiList });
     return [];

[NoCoverage] ConditionalExpression
src/lib/checker.js:138:7
  * @returns {Promise<Object[]>} - Array of check results
  */
 export async function checkMultipleDOIs(doiList, options = {}) {
-  if (!doiList || !Array.isArray(doiList)) {
+  if (false) {
     log.warn('Invalid DOI list provided', { doiList });
     return [];

[NoCoverage] StringLiteral
src/lib/checker.js:139:14
  */
 export async function checkMultipleDOIs(doiList, options = {}) {
   if (!doiList || !Array.isArray(doiList)) {
-    log.warn('Invalid DOI list provided', { doiList });
+    log.warn("", { doiList });
     return [];
   }

[NoCoverage] StringLiteral
src/lib/checker.js:143:12
     return [];
   }
   
-  log.info(`Checking ${doiList.length} DOIs`);
+  log.info(``);
   const results = [];
   let successCount = 0;

[NoCoverage] BlockStatement
src/lib/checker.js:148:30
   let successCount = 0;
   let failureCount = 0;
   
-  for (const doi of doiList) {
-    try {
-      const result = await checkSingleDOI(doi, options);
-      results.push(result);
-      
-      if (result.working) {
-        successCount++;
-      } else {
-        failureCount++;
-      }
-    } catch (error) {
-      log.error(`Unexpected error checking DOI ${doi}`, { error: error.message });
-      
-      results.push({
-        doi: doi,
-        working: false,
-        httpStatus: null,
-        error: `Internal error: ${error.message}`,
-        timestamp: new Date().toISOString()
-      });
-      
-      failureCount++;
-    }
-  }
+  for (const doi of doiList) {}
   
   log.info(`Completed checking ${doiList.length} DOIs`, { 

[NoCoverage] BlockStatement
src/lib/checker.js:149:9
   let failureCount = 0;
   
   for (const doi of doiList) {
-    try {
-      const result = await checkSingleDOI(doi, options);
-      results.push(result);
-      
-      if (result.working) {
-        successCount++;
-      } else {
-        failureCount++;
-      }
-    } catch (error) {
+    try {} catch (error) {
       log.error(`Unexpected error checking DOI ${doi}`, { error: error.message });
       

[NoCoverage] BlockStatement
src/lib/checker.js:153:27
       const result = await checkSingleDOI(doi, options);
       results.push(result);
       
-      if (result.working) {
-        successCount++;
-      } else {
+      if (result.working) {} else {
         failureCount++;
       }

[NoCoverage] ConditionalExpression
src/lib/checker.js:153:11
       const result = await checkSingleDOI(doi, options);
       results.push(result);
       
-      if (result.working) {
+      if (true) {
         successCount++;
       } else {

[NoCoverage] UpdateOperator
src/lib/checker.js:154:9
       results.push(result);
       
       if (result.working) {
-        successCount++;
+        successCount--;
       } else {
         failureCount++;

[NoCoverage] BlockStatement
src/lib/checker.js:155:14
       
       if (result.working) {
         successCount++;
-      } else {
-        failureCount++;
-      }
+      } else {}
     } catch (error) {
       log.error(`Unexpected error checking DOI ${doi}`, { error: error.message });

[NoCoverage] UpdateOperator
src/lib/checker.js:156:9
       if (result.working) {
         successCount++;
       } else {
-        failureCount++;
+        failureCount--;
       }
     } catch (error) {

[NoCoverage] BlockStatement
src/lib/checker.js:158:21
       } else {
         failureCount++;
       }
-    } catch (error) {
-      log.error(`Unexpected error checking DOI ${doi}`, { error: error.message });
-      
-      results.push({
-        doi: doi,
-        working: false,
-        httpStatus: null,
-        error: `Internal error: ${error.message}`,
-        timestamp: new Date().toISOString()
-      });
-      
-      failureCount++;
-    }
+    } catch (error) {}
   }
   

[NoCoverage] ObjectLiteral
src/lib/checker.js:161:20
     } catch (error) {
       log.error(`Unexpected error checking DOI ${doi}`, { error: error.message });
       
-      results.push({
-        doi: doi,
-        working: false,
-        httpStatus: null,
-        error: `Internal error: ${error.message}`,
-        timestamp: new Date().toISOString()
-      });
+      results.push({});
       
       failureCount++;

[NoCoverage] StringLiteral
src/lib/checker.js:165:16
         doi: doi,
         working: false,
         httpStatus: null,
-        error: `Internal error: ${error.message}`,
+        error: ``,
         timestamp: new Date().toISOString()
       });

[NoCoverage] UpdateOperator
src/lib/checker.js:169:7
         timestamp: new Date().toISOString()
       });
       
-      failureCount++;
+      failureCount--;
     }
   }

[Survived] BooleanLiteral
src/lib/checker.js:189:7
  * @returns {Object} - Processing results including newly broken DOIs
  */
 export function processResults(results, previousStatuses = {}) {
-  if (!results || !Array.isArray(results)) {
+  if (results || !Array.isArray(results)) {
     log.warn('Invalid results array', { results });
     return {

[Survived] LogicalOperator
src/lib/checker.js:189:7
  * @returns {Object} - Processing results including newly broken DOIs
  */
 export function processResults(results, previousStatuses = {}) {
-  if (!results || !Array.isArray(results)) {
+  if (!results && !Array.isArray(results)) {
     log.warn('Invalid results array', { results });
     return {

[NoCoverage] ArrayDeclaration
src/lib/checker.js:195:20
       total: 0,
       working: 0,
       broken: 0,
-      newlyBroken: []
+      newlyBroken: ["Stryker was here"]
     };
   }

[NoCoverage] BlockStatement
src/lib/checker.js:201:33
   
   const newlyBroken = [];
   
-  for (const result of results) {
-    const doi = result.doi;
-    const previousStatus = previousStatuses[doi];
-    
-    // If it was working before but is broken now, it's newly broken
-    if (previousStatus?.working && !result.working) {
-      log.warn(`DOI has become broken: ${doi}`, { 
-        previousStatus: previousStatus?.httpStatus,
-        currentStatus: result.httpStatus,
-        error: result.error
-      });
-      newlyBroken.push(doi);
-    }
-  }
+  for (const result of results) {}
   
   const processedResults = {

[NoCoverage] BlockStatement
src/lib/checker.js:206:53
     const previousStatus = previousStatuses[doi];
     
     // If it was working before but is broken now, it's newly broken
-    if (previousStatus?.working && !result.working) {
-      log.warn(`DOI has become broken: ${doi}`, { 
-        previousStatus: previousStatus?.httpStatus,
-        currentStatus: result.httpStatus,
-        error: result.error
-      });
-      newlyBroken.push(doi);
-    }
+    if (previousStatus?.working && !result.working) {}
   }
   

[NoCoverage] BooleanLiteral
src/lib/checker.js:206:36
     const previousStatus = previousStatuses[doi];
     
     // If it was working before but is broken now, it's newly broken
-    if (previousStatus?.working && !result.working) {
+    if (previousStatus?.working && result.working) {
       log.warn(`DOI has become broken: ${doi}`, { 
         previousStatus: previousStatus?.httpStatus,

[NoCoverage] ObjectLiteral
src/lib/checker.js:207:49
     
     // If it was working before but is broken now, it's newly broken
     if (previousStatus?.working && !result.working) {
-      log.warn(`DOI has become broken: ${doi}`, { 
-        previousStatus: previousStatus?.httpStatus,
-        currentStatus: result.httpStatus,
-        error: result.error
-      });
+      log.warn(`DOI has become broken: ${doi}`, {});
       newlyBroken.push(doi);
     }

[NoCoverage] OptionalChaining
src/lib/checker.js:208:25
     // If it was working before but is broken now, it's newly broken
     if (previousStatus?.working && !result.working) {
       log.warn(`DOI has become broken: ${doi}`, { 
-        previousStatus: previousStatus?.httpStatus,
+        previousStatus: previousStatus.httpStatus,
         currentStatus: result.httpStatus,
         error: result.error

[Killed] ObjectLiteral
src/lib/checker.js:216:28
     }
   }
   
-  const processedResults = {
-    total: results.length,
-    working: results.filter(r => r.working).length,
-    broken: results.filter(r => !r.working).length,
-    newlyBroken: newlyBroken
-  };
+  const processedResults = {};
   
   log.info('Processed results', processedResults);
killedBy: checker processResults should return empty result for empty input
statusReason: expected {} to deeply equal { total: +0, working: +0, …(2) }

[Survived] ArrowFunction
src/lib/checker.js:218:29
   
   const processedResults = {
     total: results.length,
-    working: results.filter(r => r.working).length,
+    working: results.filter(() => undefined).length,
     broken: results.filter(r => !r.working).length,
     newlyBroken: newlyBroken

[Survived] MethodExpression
src/lib/checker.js:218:14
   
   const processedResults = {
     total: results.length,
-    working: results.filter(r => r.working).length,
+    working: results.length,
     broken: results.filter(r => !r.working).length,
     newlyBroken: newlyBroken

[NoCoverage] BooleanLiteral
src/lib/checker.js:219:33
   const processedResults = {
     total: results.length,
     working: results.filter(r => r.working).length,
-    broken: results.filter(r => !r.working).length,
+    broken: results.filter(r => r.working).length,
     newlyBroken: newlyBroken
   };

[Survived] ArrowFunction
src/lib/checker.js:219:28
   const processedResults = {
     total: results.length,
     working: results.filter(r => r.working).length,
-    broken: results.filter(r => !r.working).length,
+    broken: results.filter(() => undefined).length,
     newlyBroken: newlyBroken
   };

[NoCoverage] StringLiteral
src/lib/checker.js:240:14
     const parsedDOI = parseDOI(doi);
     const doiUrl = parsedDOI.url;
     
-    log.info(`Generating report for DOI: ${doi}`, { url: doiUrl });
+    log.info(``, { url: doiUrl });
     
     // First do a HEAD request to check status

[NoCoverage] ObjectLiteral
src/lib/checker.js:240:51
     const parsedDOI = parseDOI(doi);
     const doiUrl = parsedDOI.url;
     
-    log.info(`Generating report for DOI: ${doi}`, { url: doiUrl });
+    log.info(`Generating report for DOI: ${doi}`, {});
     
     // First do a HEAD request to check status

[NoCoverage] ConditionalExpression
src/lib/checker.js:247:9
     
     // If the DOI is working, try to get more information with a GET request
     let metadata = null;
-    if (headResult.working) {
+    if (true) {
       try {
         const response = await fetch(doiUrl, {

[NoCoverage] ConditionalExpression
src/lib/checker.js:247:9
     
     // If the DOI is working, try to get more information with a GET request
     let metadata = null;
-    if (headResult.working) {
+    if (false) {
       try {
         const response = await fetch(doiUrl, {

[NoCoverage] ConditionalExpression
src/lib/checker.js:252:27
         const response = await fetch(doiUrl, {
           method: 'GET',
           headers: {
-            'User-Agent': options.userAgent || DEFAULT_CHECK_OPTIONS.userAgent,
+            'User-Agent': false,
             'Accept': 'application/json, text/plain, */*'
           },

[NoCoverage] LogicalOperator
src/lib/checker.js:252:27
         const response = await fetch(doiUrl, {
           method: 'GET',
           headers: {
-            'User-Agent': options.userAgent || DEFAULT_CHECK_OPTIONS.userAgent,
+            'User-Agent': options.userAgent && DEFAULT_CHECK_OPTIONS.userAgent,
             'Accept': 'application/json, text/plain, */*'
           },

[NoCoverage] ConditionalExpression
src/lib/checker.js:256:22
             'Accept': 'application/json, text/plain, */*'
           },
           cf: {
-            timeout: options.timeout || DEFAULT_CHECK_OPTIONS.timeout
+            timeout: true
           }
         });

[NoCoverage] ConditionalExpression
src/lib/checker.js:256:22
             'Accept': 'application/json, text/plain, */*'
           },
           cf: {
-            timeout: options.timeout || DEFAULT_CHECK_OPTIONS.timeout
+            timeout: false
           }
         });

[NoCoverage] ConditionalExpression
src/lib/checker.js:263:13
         // Try to extract some metadata from the response
         const contentType = response.headers.get('content-type');
         
-        if (contentType && contentType.includes('json')) {
+        if (false) {
           const jsonData = await response.json();
           metadata = {

[NoCoverage] LogicalOperator
src/lib/checker.js:263:13
         // Try to extract some metadata from the response
         const contentType = response.headers.get('content-type');
         
-        if (contentType && contentType.includes('json')) {
+        if (contentType || contentType.includes('json')) {
           const jsonData = await response.json();
           metadata = {

[NoCoverage] ObjectLiteral
src/lib/checker.js:265:22
         
         if (contentType && contentType.includes('json')) {
           const jsonData = await response.json();
-          metadata = {
-            title: jsonData.title,
-            publisher: jsonData.publisher,
-            type: jsonData.type,
-            contentType
-          };
+          metadata = {};
         } else {
           metadata = {

[NoCoverage] BlockStatement
src/lib/checker.js:271:16
             type: jsonData.type,
             contentType
           };
-        } else {
-          metadata = {
-            contentType,
-            finalUrl: response.url
-          };
-        }
+        } else {}
       } catch (error) {
         log.warn(`Error fetching metadata for DOI ${doi}`, { error: error.message });

[NoCoverage] BlockStatement
src/lib/checker.js:277:23
             finalUrl: response.url
           };
         }
-      } catch (error) {
-        log.warn(`Error fetching metadata for DOI ${doi}`, { error: error.message });
-        metadata = { error: error.message };
-      }
+      } catch (error) {}
     }
     

[NoCoverage] ObjectLiteral
src/lib/checker.js:278:60
           };
         }
       } catch (error) {
-        log.warn(`Error fetching metadata for DOI ${doi}`, { error: error.message });
+        log.warn(`Error fetching metadata for DOI ${doi}`, {});
         metadata = { error: error.message };
       }

[NoCoverage] ObjectLiteral
src/lib/checker.js:279:20
         }
       } catch (error) {
         log.warn(`Error fetching metadata for DOI ${doi}`, { error: error.message });
-        metadata = { error: error.message };
+        metadata = {};
       }
     }

[NoCoverage] ObjectLiteral
src/lib/checker.js:283:12
       }
     }
     
-    return {
-      ...headResult,
-      metadata,
-      parsedDOI
-    };
+    return {};
   } catch (error) {
     log.error(`Error generating report for DOI ${doi}`, { error: error.message });

[NoCoverage] BlockStatement
src/lib/checker.js:288:19
       metadata,
       parsedDOI
     };
-  } catch (error) {
-    log.error(`Error generating report for DOI ${doi}`, { error: error.message });
-    
-    return {
-      doi: doi,
-      working: false,
-      httpStatus: null,
-      error: error.message,
-      timestamp: new Date().toISOString()
-    };
-  }
+  } catch (error) {}
 }
 

[NoCoverage] ObjectLiteral
src/lib/checker.js:289:57
       parsedDOI
     };
   } catch (error) {
-    log.error(`Error generating report for DOI ${doi}`, { error: error.message });
+    log.error(`Error generating report for DOI ${doi}`, {});
     
     return {
