[Survived] BooleanLiteral
src/lib/activitypub.js:14:12
 
 // Default configuration
 const DEFAULT_CONFIG = {
-  enabled: true,
+  enabled: false,
   contentType: 'application/json',
   timeout: 10000, // 10 seconds

[Killed] ConditionalExpression
src/lib/activitypub.js:38:7
  * @returns {string} - Formatted message text
  */
 export function formatActivityPubMessage(brokenDOIs, options = {}) {
-  if (!brokenDOIs || !Array.isArray(brokenDOIs) || brokenDOIs.length === 0) {
+  if (true) {
     log.warn('No broken DOIs provided for message formatting');
     return '';
killedBy: activitypub formatActivityPubMessage should format a message with default options
statusReason: expected '' to contain 'DOI Link Check Alert'

[Killed] BooleanLiteral
src/lib/activitypub.js:38:22
  * @returns {string} - Formatted message text
  */
 export function formatActivityPubMessage(brokenDOIs, options = {}) {
-  if (!brokenDOIs || !Array.isArray(brokenDOIs) || brokenDOIs.length === 0) {
+  if (!brokenDOIs || Array.isArray(brokenDOIs) || brokenDOIs.length === 0) {
     log.warn('No broken DOIs provided for message formatting');
     return '';
killedBy: activitypub formatActivityPubMessage should format a message with default options
statusReason: expected '' to contain 'DOI Link Check Alert'

[NoCoverage] StringLiteral
src/lib/activitypub.js:40:12
 export function formatActivityPubMessage(brokenDOIs, options = {}) {
   if (!brokenDOIs || !Array.isArray(brokenDOIs) || brokenDOIs.length === 0) {
     log.warn('No broken DOIs provided for message formatting');
-    return '';
+    return "Stryker was here!";
   }
   

[Killed] ConditionalExpression
src/lib/activitypub.js:43:17
     return '';
   }
   
-  const emoji = options.emoji || '=';
+  const emoji = true;
   const doiBaseUrl = options.doiBaseUrl || 'https://doi.org/';
   
killedBy: activitypub formatActivityPubMessage should include custom emoji and DOI base URL
statusReason: expected 'true DOI Link Check Alert: 1 broken D…' to contain '🚨 DOI Link Check Alert'

[Killed] ConditionalExpression
src/lib/activitypub.js:43:17
     return '';
   }
   
-  const emoji = options.emoji || '=';
+  const emoji = false;
   const doiBaseUrl = options.doiBaseUrl || 'https://doi.org/';
   
killedBy: activitypub formatActivityPubMessage should include custom emoji and DOI base URL
statusReason: expected 'false DOI Link Check Alert: 1 broken …' to contain '🚨 DOI Link Check Alert'

[Killed] ConditionalExpression
src/lib/activitypub.js:44:22
   }
   
   const emoji = options.emoji || '=';
-  const doiBaseUrl = options.doiBaseUrl || 'https://doi.org/';
+  const doiBaseUrl = false;
   
   let message = `${emoji} DOI Link Check Alert: ${brokenDOIs.length} broken DOI(s) found:\n`;
killedBy: activitypub formatActivityPubMessage should include custom emoji and DOI base URL
statusReason: expected '🚨 DOI Link Check Alert: 1 broken DOI…' to contain 'https://custom.doi.org/10.1000/xyz123'

[Killed] ConditionalExpression
src/lib/activitypub.js:44:22
   }
   
   const emoji = options.emoji || '=';
-  const doiBaseUrl = options.doiBaseUrl || 'https://doi.org/';
+  const doiBaseUrl = true;
   
   let message = `${emoji} DOI Link Check Alert: ${brokenDOIs.length} broken DOI(s) found:\n`;
killedBy: activitypub formatActivityPubMessage should include custom emoji and DOI base URL
statusReason: expected '🚨 DOI Link Check Alert: 1 broken DOI…' to contain 'https://custom.doi.org/10.1000/xyz123'

[Killed] ArrowFunction
src/lib/activitypub.js:47:29
   const doiBaseUrl = options.doiBaseUrl || 'https://doi.org/';
   
   let message = `${emoji} DOI Link Check Alert: ${brokenDOIs.length} broken DOI(s) found:\n`;
-  message += brokenDOIs.map(doi => `" ${doiBaseUrl}${doi}`).join('\n');
+  message += brokenDOIs.map(() => undefined).join('\n');
   
   // Add timestamp if requested
killedBy: activitypub formatActivityPubMessage should format a message with default options
statusReason: expected '=\u0017 DOI Link Check Alert: 2 broke…' to contain '10.1000/xyz123'

[Killed] AssignmentOperator
src/lib/activitypub.js:47:3
   const doiBaseUrl = options.doiBaseUrl || 'https://doi.org/';
   
   let message = `${emoji} DOI Link Check Alert: ${brokenDOIs.length} broken DOI(s) found:\n`;
-  message += brokenDOIs.map(doi => `" ${doiBaseUrl}${doi}`).join('\n');
+  message -= brokenDOIs.map(doi => `" ${doiBaseUrl}${doi}`).join('\n');
   
   // Add timestamp if requested
killedBy: activitypub formatActivityPubMessage should format a message with default options
statusReason: expected [] to include 'DOI Link Check Alert'

[Survived] ConditionalExpression
src/lib/activitypub.js:50:7
   message += brokenDOIs.map(doi => `" ${doiBaseUrl}${doi}`).join('\n');
   
   // Add timestamp if requested
-  if (options.includeTimestamp) {
+  if (true) {
     message += `\n\nChecked at: ${new Date().toISOString()}`;
   }

[NoCoverage] BlockStatement
src/lib/activitypub.js:50:33
   message += brokenDOIs.map(doi => `" ${doiBaseUrl}${doi}`).join('\n');
   
   // Add timestamp if requested
-  if (options.includeTimestamp) {
-    message += `\n\nChecked at: ${new Date().toISOString()}`;
-  }
+  if (options.includeTimestamp) {}
   
   // Add signature if provided

[NoCoverage] BlockStatement
src/lib/activitypub.js:55:26
   }
   
   // Add signature if provided
-  if (options.signature) {
-    message += `\n\n${options.signature}`;
-  }
+  if (options.signature) {}
   
   // Truncate if message is too long

[Survived] ConditionalExpression
src/lib/activitypub.js:55:7
   }
   
   // Add signature if provided
-  if (options.signature) {
+  if (true) {
     message += `\n\n${options.signature}`;
   }

[Killed] ConditionalExpression
src/lib/activitypub.js:60:21
   }
   
   // Truncate if message is too long
-  const maxLength = options.maxLength || DEFAULT_CONFIG.maxPostLength;
+  const maxLength = false;
   if (message.length > maxLength) {
     const truncatedMessage = message.substring(0, maxLength - 3) + '...';
killedBy: activitypub formatActivityPubMessage should format a message with default options
statusReason: expected '...' to contain 'DOI Link Check Alert'

[Killed] LogicalOperator
src/lib/activitypub.js:60:21
   }
   
   // Truncate if message is too long
-  const maxLength = options.maxLength || DEFAULT_CONFIG.maxPostLength;
+  const maxLength = options.maxLength && DEFAULT_CONFIG.maxPostLength;
   if (message.length > maxLength) {
     const truncatedMessage = message.substring(0, maxLength - 3) + '...';
killedBy: activitypub formatActivityPubMessage should truncate message if it exceeds max length
statusReason: expected 500 to be less than or equal to 50

[Killed] ConditionalExpression
src/lib/activitypub.js:61:7
   
   // Truncate if message is too long
   const maxLength = options.maxLength || DEFAULT_CONFIG.maxPostLength;
-  if (message.length > maxLength) {
+  if (false) {
     const truncatedMessage = message.substring(0, maxLength - 3) + '...';
     log.warn(`Message truncated from ${message.length} to ${truncatedMessage.length} characters`);
killedBy: activitypub formatActivityPubMessage should truncate message if it exceeds max length
statusReason: expected 708 to be less than or equal to 50

[Killed] BlockStatement
src/lib/activitypub.js:61:35
   
   // Truncate if message is too long
   const maxLength = options.maxLength || DEFAULT_CONFIG.maxPostLength;
-  if (message.length > maxLength) {
-    const truncatedMessage = message.substring(0, maxLength - 3) + '...';
-    log.warn(`Message truncated from ${message.length} to ${truncatedMessage.length} characters`);
-    return truncatedMessage;
-  }
+  if (message.length > maxLength) {}
   
   return message;
killedBy: activitypub formatActivityPubMessage should truncate message if it exceeds max length
statusReason: expected 708 to be less than or equal to 50

[Killed] ArithmeticOperator
src/lib/activitypub.js:62:51
   // Truncate if message is too long
   const maxLength = options.maxLength || DEFAULT_CONFIG.maxPostLength;
   if (message.length > maxLength) {
-    const truncatedMessage = message.substring(0, maxLength - 3) + '...';
+    const truncatedMessage = message.substring(0, maxLength + 3) + '...';
     log.warn(`Message truncated from ${message.length} to ${truncatedMessage.length} characters`);
     return truncatedMessage;
killedBy: activitypub formatActivityPubMessage should truncate message if it exceeds max length
statusReason: expected 56 to be less than or equal to 50

[Killed] MethodExpression
src/lib/activitypub.js:62:30
   // Truncate if message is too long
   const maxLength = options.maxLength || DEFAULT_CONFIG.maxPostLength;
   if (message.length > maxLength) {
-    const truncatedMessage = message.substring(0, maxLength - 3) + '...';
+    const truncatedMessage = message + '...';
     log.warn(`Message truncated from ${message.length} to ${truncatedMessage.length} characters`);
     return truncatedMessage;
killedBy: activitypub formatActivityPubMessage should truncate message if it exceeds max length
statusReason: expected 711 to be less than or equal to 50

[NoCoverage] ObjectLiteral
src/lib/activitypub.js:78:22
  * @throws {ExternalServiceError} - If the ActivityPub server request fails
  */
 export async function postToActivityPub(message, config) {
-  const fullConfig = { ...DEFAULT_CONFIG, ...config };
+  const fullConfig = {};
   
   if (!fullConfig.enabled) {

[NoCoverage] BooleanLiteral
src/lib/activitypub.js:80:7
 export async function postToActivityPub(message, config) {
   const fullConfig = { ...DEFAULT_CONFIG, ...config };
   
-  if (!fullConfig.enabled) {
+  if (fullConfig.enabled) {
     log.info('ActivityPub posting disabled');
     return null;

[NoCoverage] BlockStatement
src/lib/activitypub.js:80:28
 export async function postToActivityPub(message, config) {
   const fullConfig = { ...DEFAULT_CONFIG, ...config };
   
-  if (!fullConfig.enabled) {
-    log.info('ActivityPub posting disabled');
-    return null;
-  }
+  if (!fullConfig.enabled) {}
   
   if (!fullConfig.serverUrl) {

[NoCoverage] ConditionalExpression
src/lib/activitypub.js:85:7
     return null;
   }
   
-  if (!fullConfig.serverUrl) {
+  if (false) {
     const error = 'ActivityPub server URL is required';
     log.error(error);

[NoCoverage] ConditionalExpression
src/lib/activitypub.js:85:7
     return null;
   }
   
-  if (!fullConfig.serverUrl) {
+  if (true) {
     const error = 'ActivityPub server URL is required';
     log.error(error);

[NoCoverage] BooleanLiteral
src/lib/activitypub.js:91:7
     throw new ExternalServiceError(error);
   }
   
-  if (!fullConfig.authToken) {
+  if (fullConfig.authToken) {
     const error = 'ActivityPub auth token is required';
     log.error(error);

[NoCoverage] BlockStatement
src/lib/activitypub.js:91:30
     throw new ExternalServiceError(error);
   }
   
-  if (!fullConfig.authToken) {
-    const error = 'ActivityPub auth token is required';
-    log.error(error);
-    throw new ExternalServiceError(error);
-  }
+  if (!fullConfig.authToken) {}
   
   if (!message) {

[NoCoverage] BlockStatement
src/lib/activitypub.js:97:17
     throw new ExternalServiceError(error);
   }
   
-  if (!message) {
-    const error = 'Message content is required';
-    log.error(error);
-    throw new ExternalServiceError(error);
-  }
+  if (!message) {}
   
   log.info('Posting to ActivityPub', { 

[NoCoverage] ObjectLiteral
src/lib/activitypub.js:103:38
     throw new ExternalServiceError(error);
   }
   
-  log.info('Posting to ActivityPub', { 
-    serverUrl: fullConfig.serverUrl,
-    messageLength: message.length
-  });
+  log.info('Posting to ActivityPub', {});
   
   // Initialize retry counter

[NoCoverage] EqualityOperator
src/lib/activitypub.js:112:10
   let retries = 0;
   let lastError = null;
   
-  while (retries <= fullConfig.maxRetries) {
+  while (retries > fullConfig.maxRetries) {
     try {
       if (retries > 0) {

[NoCoverage] EqualityOperator
src/lib/activitypub.js:112:10
   let retries = 0;
   let lastError = null;
   
-  while (retries <= fullConfig.maxRetries) {
+  while (retries < fullConfig.maxRetries) {
     try {
       if (retries > 0) {

[NoCoverage] ConditionalExpression
src/lib/activitypub.js:114:11
   
   while (retries <= fullConfig.maxRetries) {
     try {
-      if (retries > 0) {
+      if (true) {
         log.debug(`Retry ${retries}/${fullConfig.maxRetries} for ActivityPub post`);
         await sleep(fullConfig.retryDelay);

[NoCoverage] StringLiteral
src/lib/activitypub.js:123:28
         method: 'POST',
         headers: {
           'Content-Type': fullConfig.contentType,
-          'Authorization': `Bearer ${fullConfig.authToken}`
+          'Authorization': ``
         },
         body: JSON.stringify({

[NoCoverage] BlockStatement
src/lib/activitypub.js:133:25
         }
       });
       
-      if (!response.ok) {
-        const errorText = await response.text().catch(() => 'Unknown error');
-        throw new ExternalServiceError(
-          `ActivityPub server responded with ${response.status}: ${errorText}`,
-          { status: response.status }
-        );
-      }
+      if (!response.ok) {}
       
       const responseData = await response.json().catch(() => ({}));

[NoCoverage] ArrowFunction
src/lib/activitypub.js:134:55
       });
       
       if (!response.ok) {
-        const errorText = await response.text().catch(() => 'Unknown error');
+        const errorText = await response.text().catch(() => undefined);
         throw new ExternalServiceError(
           `ActivityPub server responded with ${response.status}: ${errorText}`,

[NoCoverage] StringLiteral
src/lib/activitypub.js:134:61
       });
       
       if (!response.ok) {
-        const errorText = await response.text().catch(() => 'Unknown error');
+        const errorText = await response.text().catch(() => "");
         throw new ExternalServiceError(
           `ActivityPub server responded with ${response.status}: ${errorText}`,

[NoCoverage] StringLiteral
src/lib/activitypub.js:136:11
       if (!response.ok) {
         const errorText = await response.text().catch(() => 'Unknown error');
         throw new ExternalServiceError(
-          `ActivityPub server responded with ${response.status}: ${errorText}`,
+          ``,
           { status: response.status }
         );

[NoCoverage] ArrowFunction
src/lib/activitypub.js:141:56
         );
       }
       
-      const responseData = await response.json().catch(() => ({}));
+      const responseData = await response.json().catch(() => undefined);
       log.info('Successfully posted to ActivityPub', { 
         statusCode: response.status,

[NoCoverage] StringLiteral
src/lib/activitypub.js:142:16
       }
       
       const responseData = await response.json().catch(() => ({}));
-      log.info('Successfully posted to ActivityPub', { 
+      log.info("", { 
         statusCode: response.status,
         responseId: responseData.id

[NoCoverage] BlockStatement
src/lib/activitypub.js:148:21
       });
       
       return responseData;
-    } catch (error) {
-      lastError = error;
-      retries++;
-      log.warn(`Error posting to ActivityPub (attempt ${retries})`, { 
-        error: error.message 
-      });
-    }
+    } catch (error) {}
   }
   

[NoCoverage] ObjectLiteral
src/lib/activitypub.js:151:69
     } catch (error) {
       lastError = error;
       retries++;
-      log.warn(`Error posting to ActivityPub (attempt ${retries})`, { 
-        error: error.message 
-      });
+      log.warn(`Error posting to ActivityPub (attempt ${retries})`, {});
     }
   }

[NoCoverage] ObjectLiteral
src/lib/activitypub.js:159:27
   
   // If we've exhausted all retries
   const errorMessage = `Failed to post to ActivityPub after ${fullConfig.maxRetries} retries`;
-  log.error(errorMessage, {
-    error: lastError?.message
-  });
+  log.error(errorMessage, {});
   
   throw new ExternalServiceError(

[NoCoverage] OptionalChaining
src/lib/activitypub.js:160:12
   // If we've exhausted all retries
   const errorMessage = `Failed to post to ActivityPub after ${fullConfig.maxRetries} retries`;
   log.error(errorMessage, {
-    error: lastError?.message
+    error: lastError.message
   });
   

[Survived] ConditionalExpression
src/lib/activitypub.js:176:22
  * @returns {Promise<Object>} - Server response or null if disabled
  */
 export async function postBrokenDOIsToActivityPub(brokenDOIs, config = {}) {
-  if (!brokenDOIs || brokenDOIs.length === 0) {
+  if (!brokenDOIs || false) {
     log.info('No broken DOIs to post');
     return null;

[Survived] ConditionalExpression
src/lib/activitypub.js:176:7
  * @returns {Promise<Object>} - Server response or null if disabled
  */
 export async function postBrokenDOIsToActivityPub(brokenDOIs, config = {}) {
-  if (!brokenDOIs || brokenDOIs.length === 0) {
+  if (true) {
     log.info('No broken DOIs to post');
     return null;

[NoCoverage] StringLiteral
src/lib/activitypub.js:177:14
  */
 export async function postBrokenDOIsToActivityPub(brokenDOIs, config = {}) {
   if (!brokenDOIs || brokenDOIs.length === 0) {
-    log.info('No broken DOIs to post');
+    log.info("");
     return null;
   }

[Survived] BooleanLiteral
src/lib/activitypub.js:184:7
   const fullConfig = { ...DEFAULT_CONFIG, ...config };
   
   // Check if ActivityPub posting is enabled
-  if (!fullConfig.enabled) {
+  if (fullConfig.enabled) {
     log.info('ActivityPub posting disabled');
     log.info('Would post to ActivityPub', { 

[Survived] BlockStatement
src/lib/activitypub.js:184:28
   const fullConfig = { ...DEFAULT_CONFIG, ...config };
   
   // Check if ActivityPub posting is enabled
-  if (!fullConfig.enabled) {
-    log.info('ActivityPub posting disabled');
-    log.info('Would post to ActivityPub', { 
-      brokenDOIs: brokenDOIs,
-      count: brokenDOIs.length
-    });
-    return null;
-  }
+  if (!fullConfig.enabled) {}
   
   try {

[Survived] ObjectLiteral
src/lib/activitypub.js:186:43
   // Check if ActivityPub posting is enabled
   if (!fullConfig.enabled) {
     log.info('ActivityPub posting disabled');
-    log.info('Would post to ActivityPub', { 
-      brokenDOIs: brokenDOIs,
-      count: brokenDOIs.length
-    });
+    log.info('Would post to ActivityPub', {});
     return null;
   }

[NoCoverage] BlockStatement
src/lib/activitypub.js:193:7
     return null;
   }
   
-  try {
-    const message = formatActivityPubMessage(brokenDOIs, fullConfig);
-    return await postToActivityPub(message, fullConfig);
-  } catch (error) {
+  try {} catch (error) {
     log.error('Error posting broken DOIs to ActivityPub', { 
       error: error.message,

[NoCoverage] BlockStatement
src/lib/activitypub.js:196:19
   try {
     const message = formatActivityPubMessage(brokenDOIs, fullConfig);
     return await postToActivityPub(message, fullConfig);
-  } catch (error) {
-    log.error('Error posting broken DOIs to ActivityPub', { 
-      error: error.message,
-      doiCount: brokenDOIs.length
-    });
-    throw error;
-  }
+  } catch (error) {}
 }
 

[NoCoverage] ObjectLiteral
src/lib/activitypub.js:197:59
     const message = formatActivityPubMessage(brokenDOIs, fullConfig);
     return await postToActivityPub(message, fullConfig);
   } catch (error) {
-    log.error('Error posting broken DOIs to ActivityPub', { 
-      error: error.message,
-      doiCount: brokenDOIs.length
-    });
+    log.error('Error posting broken DOIs to ActivityPub', {});
     throw error;
   }

[NoCoverage] StringLiteral
src/lib/activitypub.js:197:15
     const message = formatActivityPubMessage(brokenDOIs, fullConfig);
     return await postToActivityPub(message, fullConfig);
   } catch (error) {
-    log.error('Error posting broken DOIs to ActivityPub', { 
+    log.error("", { 
       error: error.message,
       doiCount: brokenDOIs.length
