[Survived] StringLiteral
src/worker.js:30:39
 
     const headers = {
       "Access-Control-Allow-Origin": "*",
-      "Access-Control-Allow-Methods": "GET,HEAD,POST,OPTIONS",
+      "Access-Control-Allow-Methods": "",
       "Access-Control-Max-Age": "86400",
       "Content-Type": "text/html" 

[Survived] StringLiteral
src/worker.js:31:33
     const headers = {
       "Access-Control-Allow-Origin": "*",
       "Access-Control-Allow-Methods": "GET,HEAD,POST,OPTIONS",
-      "Access-Control-Max-Age": "86400",
+      "Access-Control-Max-Age": "",
       "Content-Type": "text/html" 
     };

[Survived] StringLiteral
src/worker.js:37:26
 
     try {
       const url = new URL(request.url);
-      requestLogger.info(`Handling ${request.method} ${url.pathname}`);
+      requestLogger.info(``);
 
       // API endpoints

[Killed] EqualityOperator
src/worker.js:40:42
       requestLogger.info(`Handling ${request.method} ${url.pathname}`);
 
       // API endpoints
-      if (url.pathname === "/add-doi" && request.method === "POST") {
+      if (url.pathname === "/add-doi" && request.method !== "POST") {
         return await addDOI(request, env, requestLogger);
       }
killedBy: Worker addDOI endpoint should add a list of valid DOIs
statusReason: Unexpected token '/', "/public/index.html" is not valid JSON

[Killed] ConditionalExpression
src/worker.js:40:11
       requestLogger.info(`Handling ${request.method} ${url.pathname}`);
 
       // API endpoints
-      if (url.pathname === "/add-doi" && request.method === "POST") {
+      if (false) {
         return await addDOI(request, env, requestLogger);
       }
killedBy: Worker addDOI endpoint should add a list of valid DOIs
statusReason: Unexpected token '/', "/public/index.html" is not valid JSON

[Killed] ConditionalExpression
src/worker.js:44:11
         return await addDOI(request, env, requestLogger);
       }
 
-      if (url.pathname === "/remove-doi" && request.method === "POST") {
+      if (true) {
         return await removeDOI(request, env, requestLogger);
       }
killedBy: Worker Timestamp Logic GET /status endpoint includes new timestamp fields in the response
statusReason: expected 400 to be 200 // Object.is equality

[Survived] ConditionalExpression
src/worker.js:44:11
         return await addDOI(request, env, requestLogger);
       }
 
-      if (url.pathname === "/remove-doi" && request.method === "POST") {
+      if (false) {
         return await removeDOI(request, env, requestLogger);
       }

[Killed] ConditionalExpression
src/worker.js:48:11
         return await removeDOI(request, env, requestLogger);
       }
 
-      if (url.pathname === "/check-now" && request.method === "POST") {
+      if (true) {
         return await checkAllDOIs(env, requestLogger);
       }
killedBy: Worker Timestamp Logic GET /status endpoint includes new timestamp fields in the response
statusReason: expected 500 to be 200 // Object.is equality

[NoCoverage] ConditionalExpression
src/worker.js:48:44
         return await removeDOI(request, env, requestLogger);
       }
 
-      if (url.pathname === "/check-now" && request.method === "POST") {
+      if (url.pathname === "/check-now" && true) {
         return await checkAllDOIs(env, requestLogger);
       }

[Killed] ConditionalExpression
src/worker.js:52:11
         return await checkAllDOIs(env, requestLogger);
       }
 
-      if (url.pathname === "/status") {
+      if (false) {
         return await getStatus(env, requestLogger);
       }
killedBy: Worker Timestamp Logic GET /status endpoint includes new timestamp fields in the response
statusReason: Unexpected token '/', "/public/index.html" is not valid JSON

[Killed] EqualityOperator
src/worker.js:52:11
         return await checkAllDOIs(env, requestLogger);
       }
 
-      if (url.pathname === "/status") {
+      if (url.pathname !== "/status") {
         return await getStatus(env, requestLogger);
       }
killedBy: Worker Timestamp Logic GET /status endpoint includes new timestamp fields in the response
statusReason: Unexpected token '/', "/public/index.html" is not valid JSON

[NoCoverage] ConditionalExpression
src/worker.js:57:11
       }
 
       // Health check endpoint
-      if (url.pathname === "/health") {
+      if (true) {
         return new Response(JSON.stringify({ status: "ok" }), {
           headers: { "Content-Type": "application/json" },

[NoCoverage] EqualityOperator
src/worker.js:57:11
       }
 
       // Health check endpoint
-      if (url.pathname === "/health") {
+      if (url.pathname !== "/health") {
         return new Response(JSON.stringify({ status: "ok" }), {
           headers: { "Content-Type": "application/json" },

[NoCoverage] ObjectLiteral
src/worker.js:58:44
 
       // Health check endpoint
       if (url.pathname === "/health") {
-        return new Response(JSON.stringify({ status: "ok" }), {
+        return new Response(JSON.stringify({}), {
           headers: { "Content-Type": "application/json" },
         });

[NoCoverage] StringLiteral
src/worker.js:59:38
       // Health check endpoint
       if (url.pathname === "/health") {
         return new Response(JSON.stringify({ status: "ok" }), {
-          headers: { "Content-Type": "application/json" },
+          headers: { "Content-Type": "" },
         });
       }

[NoCoverage] BlockStatement
src/worker.js:68:21
         status: 200,
         headers: headers,
       });
-    } catch (error) {
-      requestLogger.error("Error handling request", {
-        error: error.message,
-        stack: error.stack,
-      });
-      return createErrorResponse(error);
-    }
+    } catch (error) {}
   },
 

[Killed] BlockStatement
src/worker.js:80:24
   /**
    * Handle scheduled events
    */
-  async scheduled(env) {
-    const scheduledLogger = logger.createScopedLogger("scheduled");
-
-    try {
-      scheduledLogger.info("Starting scheduled DOI check");
-      await checkAllDOIs(env, scheduledLogger);
-      scheduledLogger.info("Completed scheduled DOI check");
-    } catch (error) {
-      scheduledLogger.error("Error in scheduled DOI check", {
-        error: error.message,
-        stack: error.stack,
-      });
-      // Rethrow so Cloudflare can handle the error
-      throw error;
-    }
-  },
+  async scheduled(env) {},
 };
 
killedBy: Worker Timestamp Logic checkAllDOIs timestamp updates Scenario 1: New DOI, successful check
statusReason: expected "spy" to be called 1 times, but got 0 times

[Survived] StringLiteral
src/worker.js:81:55
    * Handle scheduled events
    */
   async scheduled(env) {
-    const scheduledLogger = logger.createScopedLogger("scheduled");
+    const scheduledLogger = logger.createScopedLogger("");
 
     try {

[Killed] BlockStatement
src/worker.js:83:9
   async scheduled(env) {
     const scheduledLogger = logger.createScopedLogger("scheduled");
 
-    try {
-      scheduledLogger.info("Starting scheduled DOI check");
-      await checkAllDOIs(env, scheduledLogger);
-      scheduledLogger.info("Completed scheduled DOI check");
-    } catch (error) {
+    try {} catch (error) {
       scheduledLogger.error("Error in scheduled DOI check", {
         error: error.message,
killedBy: Worker Timestamp Logic checkAllDOIs timestamp updates Scenario 1: New DOI, successful check
statusReason: expected "spy" to be called 1 times, but got 0 times

[Survived] StringLiteral
src/worker.js:86:28
     try {
       scheduledLogger.info("Starting scheduled DOI check");
       await checkAllDOIs(env, scheduledLogger);
-      scheduledLogger.info("Completed scheduled DOI check");
+      scheduledLogger.info("");
     } catch (error) {
       scheduledLogger.error("Error in scheduled DOI check", {

[NoCoverage] BlockStatement
src/worker.js:87:21
       scheduledLogger.info("Starting scheduled DOI check");
       await checkAllDOIs(env, scheduledLogger);
       scheduledLogger.info("Completed scheduled DOI check");
-    } catch (error) {
-      scheduledLogger.error("Error in scheduled DOI check", {
-        error: error.message,
-        stack: error.stack,
-      });
-      // Rethrow so Cloudflare can handle the error
-      throw error;
-    }
+    } catch (error) {}
   },
 };

[Killed] BooleanLiteral
src/worker.js:109:9
     // Get list of DOIs to check
     log.info("Getting DOI list");
     const doiListJson = await env.DOIS.get(DOI_CONFIG.DOI_LIST_KEY);
-    if (!doiListJson) {
+    if (doiListJson) {
       log.info("No DOIs to check");
       return new Response("No DOIs configured", { status: 200 });
killedBy: Worker Timestamp Logic checkAllDOIs timestamp updates Scenario 1: New DOI, successful check
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/worker.js:109:9
     // Get list of DOIs to check
     log.info("Getting DOI list");
     const doiListJson = await env.DOIS.get(DOI_CONFIG.DOI_LIST_KEY);
-    if (!doiListJson) {
+    if (true) {
       log.info("No DOIs to check");
       return new Response("No DOIs configured", { status: 200 });
killedBy: Worker Timestamp Logic checkAllDOIs timestamp updates Scenario 1: New DOI, successful check
statusReason: expected "spy" to be called 1 times, but got 0 times

[Survived] StringLiteral
src/worker.js:114:48
       return new Response("No DOIs configured", { status: 200 });
     }
 
-    const doiList = safeJsonParse(doiListJson, "Invalid DOI list format");
+    const doiList = safeJsonParse(doiListJson, "");
     log.info(`Found ${doiList.length} DOIs to check`);
 

[Survived] BlockStatement
src/worker.js:122:32
 
     // // Get previous statuses for comparison
     const previousStatuses = {};
-    for (const doi of doiList) {
-      log.debug(`Checking DOI: ${doi}`);
-      const statusJson = await env.STATUS.get(doi);
-      if (statusJson) {
-        try {
-          previousStatuses[doi] = JSON.parse(statusJson);
-        } catch (error) {
-          log.warn(`Error parsing previous status for DOI ${doi}`, {
-            error: error.message,
-          });
-          previousStatuses[doi] = null; // Fallback to null if parsing fails
-        }
-      } else {
-        previousStatuses[doi] = null; // No previous status found
-      }
-    }
+    for (const doi of doiList) {}
 
     //   try {

[Survived] BlockStatement
src/worker.js:125:23
     for (const doi of doiList) {
       log.debug(`Checking DOI: ${doi}`);
       const statusJson = await env.STATUS.get(doi);
-      if (statusJson) {
-        try {
-          previousStatuses[doi] = JSON.parse(statusJson);
-        } catch (error) {
-          log.warn(`Error parsing previous status for DOI ${doi}`, {
-            error: error.message,
-          });
-          previousStatuses[doi] = null; // Fallback to null if parsing fails
-        }
-      } else {
+      if (statusJson) {} else {
         previousStatuses[doi] = null; // No previous status found
       }

[Survived] ConditionalExpression
src/worker.js:125:11
     for (const doi of doiList) {
       log.debug(`Checking DOI: ${doi}`);
       const statusJson = await env.STATUS.get(doi);
-      if (statusJson) {
+      if (false) {
         try {
           previousStatuses[doi] = JSON.parse(statusJson);

[Survived] BlockStatement
src/worker.js:126:13
       log.debug(`Checking DOI: ${doi}`);
       const statusJson = await env.STATUS.get(doi);
       if (statusJson) {
-        try {
-          previousStatuses[doi] = JSON.parse(statusJson);
-        } catch (error) {
+        try {} catch (error) {
           log.warn(`Error parsing previous status for DOI ${doi}`, {
             error: error.message,

[NoCoverage] BlockStatement
src/worker.js:128:25
       if (statusJson) {
         try {
           previousStatuses[doi] = JSON.parse(statusJson);
-        } catch (error) {
-          log.warn(`Error parsing previous status for DOI ${doi}`, {
-            error: error.message,
-          });
-          previousStatuses[doi] = null; // Fallback to null if parsing fails
-        }
+        } catch (error) {}
       } else {
         previousStatuses[doi] = null; // No previous status found

[Survived] BlockStatement
src/worker.js:134:14
           });
           previousStatuses[doi] = null; // Fallback to null if parsing fails
         }
-      } else {
-        previousStatuses[doi] = null; // No previous status found
-      }
+      } else {}
     }
 

[Killed] ConditionalExpression
src/worker.js:200:11
       // Retrieve existing status
       const existingStatusJson = await env.STATUS.get(result.doi);
       let existingStatus = {};
-      if (existingStatusJson) {
+      if (false) {
         try {
           existingStatus = JSON.parse(existingStatusJson);
killedBy: Worker Timestamp Logic checkAllDOIs timestamp updates Scenario 2: Existing DOI, first check fails, second check succeeds
statusReason: expected '2025-08-19T07:20:18.911Z' to be '2025-08-19T07:18:38.911Z' // Object.is equality

[Killed] ConditionalExpression
src/worker.js:200:11
       // Retrieve existing status
       const existingStatusJson = await env.STATUS.get(result.doi);
       let existingStatus = {};
-      if (existingStatusJson) {
+      if (true) {
         try {
           existingStatus = JSON.parse(existingStatusJson);
killedBy: Worker Timestamp Logic checkAllDOIs timestamp updates Scenario 1: New DOI, successful check
statusReason: Cannot read properties of null (reading 'firstCheckedTimestamp')

[Killed] BlockStatement
src/worker.js:201:13
       const existingStatusJson = await env.STATUS.get(result.doi);
       let existingStatus = {};
       if (existingStatusJson) {
-        try {
-          existingStatus = JSON.parse(existingStatusJson);
-        } catch (error) {
+        try {} catch (error) {
           log.warn(`Error parsing existing status for DOI ${result.doi}`, {
             error: error.message,
killedBy: Worker Timestamp Logic checkAllDOIs timestamp updates Scenario 2: Existing DOI, first check fails, second check succeeds
statusReason: expected '2025-08-19T07:20:19.013Z' to be '2025-08-19T07:18:39.013Z' // Object.is equality

[NoCoverage] BlockStatement
src/worker.js:203:25
       if (existingStatusJson) {
         try {
           existingStatus = JSON.parse(existingStatusJson);
-        } catch (error) {
-          log.warn(`Error parsing existing status for DOI ${result.doi}`, {
-            error: error.message,
-          });
-        }
+        } catch (error) {}
       }
 

[Killed] ConditionalExpression
src/worker.js:211:37
       }
 
       // Initialize new timestamps if they don't exist
-      const firstCheckedTimestamp = existingStatus.firstCheckedTimestamp || result.timestamp;
+      const firstCheckedTimestamp = false;
       let firstFailureTimestamp = existingStatus.firstFailureTimestamp;
       let firstSuccessTimestamp = existingStatus.firstSuccessTimestamp;
killedBy: Worker Timestamp Logic checkAllDOIs timestamp updates Scenario 1: New DOI, successful check
statusReason: expected false to be '2025-08-19T07:20:19.267Z' // Object.is equality

[Killed] LogicalOperator
src/worker.js:211:37
       }
 
       // Initialize new timestamps if they don't exist
-      const firstCheckedTimestamp = existingStatus.firstCheckedTimestamp || result.timestamp;
+      const firstCheckedTimestamp = existingStatus.firstCheckedTimestamp && result.timestamp;
       let firstFailureTimestamp = existingStatus.firstFailureTimestamp;
       let firstSuccessTimestamp = existingStatus.firstSuccessTimestamp;
killedBy: Worker Timestamp Logic checkAllDOIs timestamp updates Scenario 1: New DOI, successful check
statusReason: expected undefined to be '2025-08-19T07:20:19.391Z' // Object.is equality

[Killed] BooleanLiteral
src/worker.js:215:11
       let firstFailureTimestamp = existingStatus.firstFailureTimestamp;
       let firstSuccessTimestamp = existingStatus.firstSuccessTimestamp;
 
-      if (!result.working && !firstFailureTimestamp) {
+      if (result.working && !firstFailureTimestamp) {
         firstFailureTimestamp = result.timestamp;
       }
killedBy: Worker Timestamp Logic checkAllDOIs timestamp updates Scenario 1: New DOI, successful check
statusReason: expected '2025-08-19T07:20:19.800Z' to be undefined

[Killed] ConditionalExpression
src/worker.js:215:11
       let firstFailureTimestamp = existingStatus.firstFailureTimestamp;
       let firstSuccessTimestamp = existingStatus.firstSuccessTimestamp;
 
-      if (!result.working && !firstFailureTimestamp) {
+      if (false) {
         firstFailureTimestamp = result.timestamp;
       }
killedBy: Worker Timestamp Logic checkAllDOIs timestamp updates Scenario 2: Existing DOI, first check fails, second check succeeds
statusReason: expected undefined to be '2025-08-19T07:18:39.582Z' // Object.is equality

[Killed] LogicalOperator
src/worker.js:218:11
       if (!result.working && !firstFailureTimestamp) {
         firstFailureTimestamp = result.timestamp;
       }
-      if (result.working && !firstSuccessTimestamp) {
+      if (result.working || !firstSuccessTimestamp) {
         firstSuccessTimestamp = result.timestamp;
       }
killedBy: Worker Timestamp Logic checkAllDOIs timestamp updates Scenario 2: Existing DOI, first check fails, second check succeeds
statusReason: expected '2025-08-19T07:18:40.267Z' to be undefined

[Killed] BlockStatement
src/worker.js:218:53
       if (!result.working && !firstFailureTimestamp) {
         firstFailureTimestamp = result.timestamp;
       }
-      if (result.working && !firstSuccessTimestamp) {
-        firstSuccessTimestamp = result.timestamp;
-      }
+      if (result.working && !firstSuccessTimestamp) {}
 
       await env.STATUS.put(
killedBy: Worker Timestamp Logic checkAllDOIs timestamp updates Scenario 1: New DOI, successful check
statusReason: expected undefined to be '2025-08-19T07:20:20.452Z' // Object.is equality

[Killed] LogicalOperator
src/worker.js:230:18
           lastCheck: result.timestamp, // Use timestamp from check result
           working: result.working,
           httpStatus: result.httpStatus,
-          error: result.error || null,
+          error: result.error && null,
           firstCheckedTimestamp: firstCheckedTimestamp,
           firstFailureTimestamp: firstFailureTimestamp,
killedBy: Worker Timestamp Logic checkAllDOIs timestamp updates Scenario 4: DOI status already has all timestamps, new check (success)
statusReason: expected undefined to be null

[Killed] ConditionalExpression
src/worker.js:230:18
           lastCheck: result.timestamp, // Use timestamp from check result
           working: result.working,
           httpStatus: result.httpStatus,
-          error: result.error || null,
+          error: true,
           firstCheckedTimestamp: firstCheckedTimestamp,
           firstFailureTimestamp: firstFailureTimestamp,
killedBy: Worker Timestamp Logic checkAllDOIs timestamp updates Scenario 4: DOI status already has all timestamps, new check (success)
statusReason: expected true to be null

[Survived] EqualityOperator
src/worker.js:239:9
     }
 
     // Post to ActivityPub if there are newly broken DOIs
-    if (newlyBroken.length > 0) {
+    if (newlyBroken.length <= 0) {
       log.info(
         `Posting ${newlyBroken.length} newly broken DOIs to ActivityPub`

[Survived] BlockStatement
src/worker.js:239:33
     }
 
     // Post to ActivityPub if there are newly broken DOIs
-    if (newlyBroken.length > 0) {
-      log.info(
-        `Posting ${newlyBroken.length} newly broken DOIs to ActivityPub`
-      );
-      // Get ActivityPub configuration from environment
-      const activityPubConfig = {
-        enabled: env.ACTIVITYPUB_ENABLED !== "false",
-        serverUrl: env.SNAC2_SERVER_URL,
-        authToken: env.SNAC2_TOKEN,
-      };
-
-      try {
-        await postBrokenDOIsToActivityPub(newlyBroken, activityPubConfig);
-      } catch (error) {
-        log.error("Error posting to ActivityPub", { error: error.message });
-        // Continue execution even if ActivityPub posting fails
-      }
-    }
+    if (newlyBroken.length > 0) {}
 
     log.info(

[Survived] ObjectLiteral
src/worker.js:244:33
         `Posting ${newlyBroken.length} newly broken DOIs to ActivityPub`
       );
       // Get ActivityPub configuration from environment
-      const activityPubConfig = {
-        enabled: env.ACTIVITYPUB_ENABLED !== "false",
-        serverUrl: env.SNAC2_SERVER_URL,
-        authToken: env.SNAC2_TOKEN,
-      };
+      const activityPubConfig = {};
 
       try {

[Survived] EqualityOperator
src/worker.js:245:18
       );
       // Get ActivityPub configuration from environment
       const activityPubConfig = {
-        enabled: env.ACTIVITYPUB_ENABLED !== "false",
+        enabled: env.ACTIVITYPUB_ENABLED === "false",
         serverUrl: env.SNAC2_SERVER_URL,
         authToken: env.SNAC2_TOKEN,

[Survived] ConditionalExpression
src/worker.js:245:18
       );
       // Get ActivityPub configuration from environment
       const activityPubConfig = {
-        enabled: env.ACTIVITYPUB_ENABLED !== "false",
+        enabled: true,
         serverUrl: env.SNAC2_SERVER_URL,
         authToken: env.SNAC2_TOKEN,

[Survived] BlockStatement
src/worker.js:250:11
         authToken: env.SNAC2_TOKEN,
       };
 
-      try {
-        await postBrokenDOIsToActivityPub(newlyBroken, activityPubConfig);
-      } catch (error) {
+      try {} catch (error) {
         log.error("Error posting to ActivityPub", { error: error.message });
         // Continue execution even if ActivityPub posting fails

[NoCoverage] BlockStatement
src/worker.js:252:23
 
       try {
         await postBrokenDOIsToActivityPub(newlyBroken, activityPubConfig);
-      } catch (error) {
-        log.error("Error posting to ActivityPub", { error: error.message });
-        // Continue execution even if ActivityPub posting fails
-      }
+      } catch (error) {}
     }
 

[Survived] StringLiteral
src/worker.js:259:7
     }
 
     log.info(
-      `Checked ${doiList.length} DOIs, ${newlyBroken.length} newly broken`
+      ``
     );
     return new Response(

[Survived] StringLiteral
src/worker.js:269:36
       }),
       {
         status: 200,
-        headers: { "Content-Type": "application/json" },
+        headers: { "Content-Type": "" },
       }
     );

[NoCoverage] BlockStatement
src/worker.js:272:19
         headers: { "Content-Type": "application/json" },
       }
     );
-  } catch (error) {
-    log.error("Error in checkAllDOIs", {
-      error: error.message,
-      stack: error.stack,
-    });
-    throw error;
-  }
+  } catch (error) {}
 }
 

[Killed] BlockStatement
src/worker.js:290:51
 export async function addDOI(request, env, log) {
   try {
     // Parse request body
-    const body = await request.json().catch(() => {
-      throw new ValidationError("Invalid JSON in request body");
-    });
+    const body = await request.json().catch(() => {});
 
     const { doi, dois } = body; // Destructure both doi and dois
killedBy: Worker addDOI endpoint should return 400 for malformed JSON in request body
statusReason: expected 500 to be 400 // Object.is equality

[Killed] StringLiteral
src/worker.js:291:33
   try {
     // Parse request body
     const body = await request.json().catch(() => {
-      throw new ValidationError("Invalid JSON in request body");
+      throw new ValidationError("");
     });
 
killedBy: Worker addDOI endpoint should return 400 for malformed JSON in request body
statusReason: expected '' to be 'Invalid JSON in request body' // Object.is equality

[Survived] ArrayDeclaration
src/worker.js:296:21
 
     const { doi, dois } = body; // Destructure both doi and dois
 
-    let doisToAdd = [];
+    let doisToAdd = ["Stryker was here"];
     if (doi) { // Handle single DOI for backward compatibility
       log.warn("Received single 'doi' field, which is deprecated. Use 'dois' array instead.");

[Killed] ConditionalExpression
src/worker.js:297:9
     const { doi, dois } = body; // Destructure both doi and dois
 
     let doisToAdd = [];
-    if (doi) { // Handle single DOI for backward compatibility
+    if (true) { // Handle single DOI for backward compatibility
       log.warn("Received single 'doi' field, which is deprecated. Use 'dois' array instead.");
       doisToAdd.push(doi);
killedBy: Worker addDOI endpoint should add a list of valid DOIs
statusReason: expected 'Processed 1 DOIs: 0 added, 0 already …' to be 'Processed 2 DOIs: 2 added, 0 already …' // Object.is equality

[Survived] ConditionalExpression
src/worker.js:297:9
     const { doi, dois } = body; // Destructure both doi and dois
 
     let doisToAdd = [];
-    if (doi) { // Handle single DOI for backward compatibility
+    if (false) { // Handle single DOI for backward compatibility
       log.warn("Received single 'doi' field, which is deprecated. Use 'dois' array instead.");
       doisToAdd.push(doi);

[Killed] ConditionalExpression
src/worker.js:300:16
     if (doi) { // Handle single DOI for backward compatibility
       log.warn("Received single 'doi' field, which is deprecated. Use 'dois' array instead.");
       doisToAdd.push(doi);
-    } else if (dois && Array.isArray(dois)) {
+    } else if (false) {
       doisToAdd = dois;
     } else {
killedBy: Worker addDOI endpoint should add a list of valid DOIs
statusReason: expected 400 to be 200 // Object.is equality

[Killed] BlockStatement
src/worker.js:300:45
     if (doi) { // Handle single DOI for backward compatibility
       log.warn("Received single 'doi' field, which is deprecated. Use 'dois' array instead.");
       doisToAdd.push(doi);
-    } else if (dois && Array.isArray(dois)) {
-      doisToAdd = dois;
-    } else {
+    } else if (dois && Array.isArray(dois)) {} else {
       throw new ValidationError("Request body must contain a 'dois' array or a single 'doi' string.");
     }
killedBy: Worker addDOI endpoint should add a list of valid DOIs
statusReason: expected 400 to be 200 // Object.is equality

[Killed] BlockStatement
src/worker.js:302:12
       doisToAdd.push(doi);
     } else if (dois && Array.isArray(dois)) {
       doisToAdd = dois;
-    } else {
-      throw new ValidationError("Request body must contain a 'dois' array or a single 'doi' string.");
-    }
+    } else {}
 
     if (doisToAdd.length === 0) {
killedBy: Worker addDOI endpoint should return 400 for invalid JSON format (not an array)
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
src/worker.js:303:33
     } else if (dois && Array.isArray(dois)) {
       doisToAdd = dois;
     } else {
-      throw new ValidationError("Request body must contain a 'dois' array or a single 'doi' string.");
+      throw new ValidationError("");
     }
 
killedBy: Worker addDOI endpoint should return 400 for invalid JSON format (not an array)
statusReason: expected '' to be 'Request body must contain a \'dois\' …' // Object.is equality

[Killed] ConditionalExpression
src/worker.js:306:9
       throw new ValidationError("Request body must contain a 'dois' array or a single 'doi' string.");
     }
 
-    if (doisToAdd.length === 0) {
+    if (false) {
       return new Response(
         JSON.stringify({ message: "No DOIs provided to add." }),
killedBy: Worker addDOI endpoint should handle an empty list of DOIs
statusReason: expected 200 to be 400 // Object.is equality

[Killed] EqualityOperator
src/worker.js:306:9
       throw new ValidationError("Request body must contain a 'dois' array or a single 'doi' string.");
     }
 
-    if (doisToAdd.length === 0) {
+    if (doisToAdd.length !== 0) {
       return new Response(
         JSON.stringify({ message: "No DOIs provided to add." }),
killedBy: Worker addDOI endpoint should add a list of valid DOIs
statusReason: expected 400 to be 200 // Object.is equality

[Killed] BlockStatement
src/worker.js:326:41
     let alreadyExistedCount = 0;
     let invalidCount = 0;
 
-    for (const currentDoi of doisToAdd) {
-      const validation = validateDOI(currentDoi);
-      if (!validation.valid) {
-        log.warn(`Invalid DOI format: ${currentDoi}. Error: ${validation.error}`);
-        results.push({ doi: currentDoi, status: "invalid", error: validation.error });
-        invalidCount++;
-        continue;
-      }
-
-      const normalizedDoi = validation.normalized;
-      if (!doiList.includes(normalizedDoi)) {
-        doiList.push(normalizedDoi);
-        results.push({ doi: currentDoi, normalized: normalizedDoi, status: "added" });
-        addedCount++;
-        log.info(`DOI added: ${currentDoi} (normalized: ${normalizedDoi})`);
-      } else {
-        results.push({ doi: currentDoi, normalized: normalizedDoi, status: "already_existed" });
-        alreadyExistedCount++;
-        log.info(`DOI already exists: ${currentDoi} (normalized: ${normalizedDoi})`);
-      }
-    }
+    for (const currentDoi of doisToAdd) {}
 
     if (addedCount > 0) {
killedBy: Worker addDOI endpoint should add a list of valid DOIs
statusReason: expected 'Processed 2 DOIs: 0 added, 0 already …' to be 'Processed 2 DOIs: 2 added, 0 already …' // Object.is equality

[Killed] BooleanLiteral
src/worker.js:328:11
 
     for (const currentDoi of doisToAdd) {
       const validation = validateDOI(currentDoi);
-      if (!validation.valid) {
+      if (validation.valid) {
         log.warn(`Invalid DOI format: ${currentDoi}. Error: ${validation.error}`);
         results.push({ doi: currentDoi, status: "invalid", error: validation.error });
killedBy: Worker addDOI endpoint should add a list of valid DOIs
statusReason: expected 'Processed 2 DOIs: 0 added, 0 already …' to be 'Processed 2 DOIs: 2 added, 0 already …' // Object.is equality
