[Survived] StringLiteral
src/lib/doi-validator.js:10:39
 import { ValidationError } from './errors.js';
 
 // Initialize module logger
-const log = logger.createScopedLogger('doi-validator');
+const log = logger.createScopedLogger("");
 
 // DOI regex patterns

[Killed] ObjectLiteral
src/lib/doi-validator.js:13:22
 const log = logger.createScopedLogger('doi-validator');
 
 // DOI regex patterns
-const DOI_PATTERNS = {
-  // Basic pattern: 10.xxxx/yyyy
-  BASIC: /^10\.\d{4,}\/\S+$/,
-  
-  // Strict pattern with more validation
-  STRICT: /^10\.\d{4,}\/[a-zA-Z0-9()[\]:.;\-_/]+$/,
-  
-  // Leading DOI prefix (remove if present)
-  PREFIX: /^(?:doi:|https?:\/\/(?:dx\.)?doi\.org\/)(10\..+)$/i
-};
+const DOI_PATTERNS = {};
 
 /**
killedBy: Worker addDOI endpoint should add a list of valid DOIs
statusReason: expected 'Processed 2 DOIs: 0 added, 0 already …' to be 'Processed 2 DOIs: 2 added, 0 already …' // Object.is equality

[Survived] Regex
src/lib/doi-validator.js:18:11
   BASIC: /^10\.\d{4,}\/\S+$/,
   
   // Strict pattern with more validation
-  STRICT: /^10\.\d{4,}\/[a-zA-Z0-9()[\]:.;\-_/]+$/,
+  STRICT: /^10\.\D{4,}\/[a-zA-Z0-9()[\]:.;\-_/]+$/,
   
   // Leading DOI prefix (remove if present)

[Survived] Regex
src/lib/doi-validator.js:18:11
   BASIC: /^10\.\d{4,}\/\S+$/,
   
   // Strict pattern with more validation
-  STRICT: /^10\.\d{4,}\/[a-zA-Z0-9()[\]:.;\-_/]+$/,
+  STRICT: /^10\.\d{4,}\/[^a-zA-Z0-9()[\]:.;\-_/]+$/,
   
   // Leading DOI prefix (remove if present)

[Survived] Regex
src/lib/doi-validator.js:21:11
   STRICT: /^10\.\d{4,}\/[a-zA-Z0-9()[\]:.;\-_/]+$/,
   
   // Leading DOI prefix (remove if present)
-  PREFIX: /^(?:doi:|https?:\/\/(?:dx\.)?doi\.org\/)(10\..+)$/i
+  PREFIX: /^(?:doi:|https?:\/\/(?:dx\.)?doi\.org\/)(10\..+)/i
 };
 

[Killed] BlockStatement
src/lib/doi-validator.js:29:35
  * @param {string} doi - The DOI string to normalize
  * @returns {string} - Normalized DOI string
  */
-export function normalizeDOI(doi) {
-  if (!doi) return '';
-  
-  // Trim whitespace
-  let normalizedDOI = doi.trim();
-  
-  // Remove DOI prefix if present
-  const prefixMatch = normalizedDOI.match(DOI_PATTERNS.PREFIX);
-  if (prefixMatch) {
-    normalizedDOI = prefixMatch[1];
-  }
-  
-  return normalizedDOI;
-}
+export function normalizeDOI(doi) {}
 
 /**
killedBy: Worker addDOI endpoint should add a list of valid DOIs
statusReason: expected 'Processed 2 DOIs: 0 added, 0 already …' to be 'Processed 2 DOIs: 2 added, 0 already …' // Object.is equality

[Killed] ConditionalExpression
src/lib/doi-validator.js:30:7
  * @returns {string} - Normalized DOI string
  */
 export function normalizeDOI(doi) {
-  if (!doi) return '';
+  if (true) return '';
   
   // Trim whitespace
killedBy: Worker addDOI endpoint should add a list of valid DOIs
statusReason: expected 'Processed 2 DOIs: 0 added, 0 already …' to be 'Processed 2 DOIs: 2 added, 0 already …' // Object.is equality

[Killed] BooleanLiteral
src/lib/doi-validator.js:30:7
  * @returns {string} - Normalized DOI string
  */
 export function normalizeDOI(doi) {
-  if (!doi) return '';
+  if (doi) return '';
   
   // Trim whitespace
killedBy: Worker addDOI endpoint should add a list of valid DOIs
statusReason: expected 'Processed 2 DOIs: 0 added, 0 already …' to be 'Processed 2 DOIs: 2 added, 0 already …' // Object.is equality

[Survived] MethodExpression
src/lib/doi-validator.js:33:23
   if (!doi) return '';
   
   // Trim whitespace
-  let normalizedDOI = doi.trim();
+  let normalizedDOI = doi;
   
   // Remove DOI prefix if present

[Killed] ConditionalExpression
src/lib/doi-validator.js:37:7
   
   // Remove DOI prefix if present
   const prefixMatch = normalizedDOI.match(DOI_PATTERNS.PREFIX);
-  if (prefixMatch) {
+  if (true) {
     normalizedDOI = prefixMatch[1];
   }
killedBy: Worker addDOI endpoint should add a list of valid DOIs
statusReason: expected 500 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/lib/doi-validator.js:37:7
   
   // Remove DOI prefix if present
   const prefixMatch = normalizedDOI.match(DOI_PATTERNS.PREFIX);
-  if (prefixMatch) {
+  if (false) {
     normalizedDOI = prefixMatch[1];
   }
killedBy: Worker addDOI endpoint should handle a mix of valid, invalid, and duplicate DOIs
statusReason: expected 'Processed 4 DOIs: 1 added, 1 already …' to be 'Processed 4 DOIs: 2 added, 1 already …' // Object.is equality

[NoCoverage] BlockStatement
src/lib/doi-validator.js:51:47
  * @param {boolean} options.strict - Whether to use strict validation
  * @returns {boolean} - True if the DOI format is valid
  */
-export function isValidDOI(doi, options = {}) {
-  if (!doi) return false;
-  
-  const normalizedDOI = normalizeDOI(doi);
-  const pattern = options.strict ? DOI_PATTERNS.STRICT : DOI_PATTERNS.BASIC;
-  
-  return pattern.test(normalizedDOI);
-}
+export function isValidDOI(doi, options = {}) {}
 
 /**

[NoCoverage] ConditionalExpression
src/lib/doi-validator.js:52:7
  * @returns {boolean} - True if the DOI format is valid
  */
 export function isValidDOI(doi, options = {}) {
-  if (!doi) return false;
+  if (false) return false;
   
   const normalizedDOI = normalizeDOI(doi);

[NoCoverage] ConditionalExpression
src/lib/doi-validator.js:52:7
  * @returns {boolean} - True if the DOI format is valid
  */
 export function isValidDOI(doi, options = {}) {
-  if (!doi) return false;
+  if (true) return false;
   
   const normalizedDOI = normalizeDOI(doi);

[Survived] StringLiteral
src/lib/doi-validator.js:70:13
  * @throws {ValidationError} - If validation fails and throwOnError is true
  */
 export function validateDOI(doi, options = {}) {
-  log.debug(`Validating DOI: ${doi}`);
+  log.debug(``);
   
   if (!doi || typeof doi !== 'string') {

[Killed] EqualityOperator
src/lib/doi-validator.js:72:15
 export function validateDOI(doi, options = {}) {
   log.debug(`Validating DOI: ${doi}`);
   
-  if (!doi || typeof doi !== 'string') {
+  if (!doi || typeof doi === 'string') {
     const error = 'DOI must be a non-empty string';
     log.warn(error, { doi });
killedBy: Worker addDOI endpoint should add a list of valid DOIs
statusReason: expected 'Processed 2 DOIs: 0 added, 0 already …' to be 'Processed 2 DOIs: 2 added, 0 already …' // Object.is equality

[Killed] BooleanLiteral
src/lib/doi-validator.js:72:7
 export function validateDOI(doi, options = {}) {
   log.debug(`Validating DOI: ${doi}`);
   
-  if (!doi || typeof doi !== 'string') {
+  if (doi || typeof doi !== 'string') {
     const error = 'DOI must be a non-empty string';
     log.warn(error, { doi });
killedBy: Worker addDOI endpoint should add a list of valid DOIs
statusReason: expected 'Processed 2 DOIs: 0 added, 0 already …' to be 'Processed 2 DOIs: 2 added, 0 already …' // Object.is equality

[Killed] ConditionalExpression
src/lib/doi-validator.js:76:9
     const error = 'DOI must be a non-empty string';
     log.warn(error, { doi });
     
-    if (options.throwOnError) {
+    if (true) {
       throw new ValidationError(error);
     }
killedBy: DOI Validator should return false for an empty string
statusReason: DOI must be a non-empty string

[NoCoverage] BlockStatement
src/lib/doi-validator.js:76:31
     const error = 'DOI must be a non-empty string';
     log.warn(error, { doi });
     
-    if (options.throwOnError) {
-      throw new ValidationError(error);
-    }
+    if (options.throwOnError) {}
     
     return {

[Killed] BooleanLiteral
src/lib/doi-validator.js:90:7
   const normalizedDOI = normalizeDOI(doi);
   
   // Check if normalization yielded an empty string
-  if (!normalizedDOI) {
+  if (normalizedDOI) {
     const error = 'DOI is empty after normalization';
     log.warn(error, { doi, normalizedDOI });
killedBy: DOI Validator should return true for a valid DOI
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/lib/doi-validator.js:90:7
   const normalizedDOI = normalizeDOI(doi);
   
   // Check if normalization yielded an empty string
-  if (!normalizedDOI) {
+  if (true) {
     const error = 'DOI is empty after normalization';
     log.warn(error, { doi, normalizedDOI });
killedBy: Worker addDOI endpoint should add a list of valid DOIs
statusReason: expected 'Processed 2 DOIs: 0 added, 0 already …' to be 'Processed 2 DOIs: 2 added, 0 already …' // Object.is equality

[NoCoverage] StringLiteral
src/lib/doi-validator.js:91:19
   
   // Check if normalization yielded an empty string
   if (!normalizedDOI) {
-    const error = 'DOI is empty after normalization';
+    const error = "";
     log.warn(error, { doi, normalizedDOI });
     

[Killed] BooleanLiteral
src/lib/doi-validator.js:106:7
   
   // Check basic pattern
   const pattern = options.strict ? DOI_PATTERNS.STRICT : DOI_PATTERNS.BASIC;
-  if (!pattern.test(normalizedDOI)) {
+  if (pattern.test(normalizedDOI)) {
     const patternType = options.strict ? 'strict' : 'basic';
     const error = `Invalid DOI format. DOI must match ${patternType} pattern: 10.xxxx/yyyy`;
killedBy: Worker addDOI endpoint should add a list of valid DOIs
statusReason: expected 'Processed 2 DOIs: 0 added, 0 already …' to be 'Processed 2 DOIs: 2 added, 0 already …' // Object.is equality

[Killed] ConditionalExpression
src/lib/doi-validator.js:106:7
   
   // Check basic pattern
   const pattern = options.strict ? DOI_PATTERNS.STRICT : DOI_PATTERNS.BASIC;
-  if (!pattern.test(normalizedDOI)) {
+  if (false) {
     const patternType = options.strict ? 'strict' : 'basic';
     const error = `Invalid DOI format. DOI must match ${patternType} pattern: 10.xxxx/yyyy`;
killedBy: Worker addDOI endpoint should handle a mix of valid, invalid, and duplicate DOIs
statusReason: expected 'Processed 4 DOIs: 3 added, 1 already …' to be 'Processed 4 DOIs: 2 added, 1 already …' // Object.is equality

[Survived] StringLiteral
src/lib/doi-validator.js:107:53
   // Check basic pattern
   const pattern = options.strict ? DOI_PATTERNS.STRICT : DOI_PATTERNS.BASIC;
   if (!pattern.test(normalizedDOI)) {
-    const patternType = options.strict ? 'strict' : 'basic';
+    const patternType = options.strict ? 'strict' : "";
     const error = `Invalid DOI format. DOI must match ${patternType} pattern: 10.xxxx/yyyy`;
     log.warn(error, { doi, normalizedDOI, patternType });

[Survived] StringLiteral
src/lib/doi-validator.js:108:19
   const pattern = options.strict ? DOI_PATTERNS.STRICT : DOI_PATTERNS.BASIC;
   if (!pattern.test(normalizedDOI)) {
     const patternType = options.strict ? 'strict' : 'basic';
-    const error = `Invalid DOI format. DOI must match ${patternType} pattern: 10.xxxx/yyyy`;
+    const error = ``;
     log.warn(error, { doi, normalizedDOI, patternType });
     

[Survived] ConditionalExpression
src/lib/doi-validator.js:111:9
     const error = `Invalid DOI format. DOI must match ${patternType} pattern: 10.xxxx/yyyy`;
     log.warn(error, { doi, normalizedDOI, patternType });
     
-    if (options.throwOnError) {
+    if (false) {
       throw new ValidationError(error);
     }

[Survived] StringLiteral
src/lib/doi-validator.js:121:13
     };
   }
   
-  log.debug(`DOI validation successful: ${normalizedDOI}`);
+  log.debug(``);
   return {
     valid: true,

[Killed] ObjectLiteral
src/lib/doi-validator.js:122:10
   }
   
   log.debug(`DOI validation successful: ${normalizedDOI}`);
-  return {
-    valid: true,
-    normalized: normalizedDOI,
-    original: doi
-  };
+  return {};
 }
 
killedBy: Worker addDOI endpoint should add a list of valid DOIs
statusReason: expected 'Processed 2 DOIs: 0 added, 0 already …' to be 'Processed 2 DOIs: 2 added, 0 already …' // Object.is equality

[NoCoverage] BlockStatement
src/lib/doi-validator.js:135:31
  * @returns {Object} - Parsed DOI components
  * @throws {ValidationError} - If DOI is invalid
  */
-export function parseDOI(doi) {
-  const validation = validateDOI(doi, { throwOnError: true });
-  const normalizedDOI = validation.normalized;
-  
-  // Split the DOI into prefix and suffix
-  const [prefix, ...suffixParts] = normalizedDOI.split('/');
-  const suffix = suffixParts.join('/');
-  
-  // Extract the registry number from the prefix
-  const registryNumber = prefix.replace(/^10\./, '');
-  
-  return {
-    doi: normalizedDOI,
-    prefix,
-    suffix,
-    registryNumber,
-    url: `https://doi.org/${normalizedDOI}`
-  };
-}
+export function parseDOI(doi) {}
 
 export default {

[NoCoverage] BooleanLiteral
src/lib/doi-validator.js:136:55
  * @throws {ValidationError} - If DOI is invalid
  */
 export function parseDOI(doi) {
-  const validation = validateDOI(doi, { throwOnError: true });
+  const validation = validateDOI(doi, { throwOnError: false });
   const normalizedDOI = validation.normalized;
   

[NoCoverage] StringLiteral
src/lib/doi-validator.js:140:56
   const normalizedDOI = validation.normalized;
   
   // Split the DOI into prefix and suffix
-  const [prefix, ...suffixParts] = normalizedDOI.split('/');
+  const [prefix, ...suffixParts] = normalizedDOI.split("");
   const suffix = suffixParts.join('/');
   

[Survived] ObjectLiteral
src/lib/doi-validator.js:155:16
   };
 }
 
-export default {
-  normalizeDOI,
-  isValidDOI,
-  validateDOI,
-  parseDOI
-};
+export default {};
 
