[Killed] BlockStatement
src/worker.js:328:30
 
     for (const currentDoi of doisToAdd) {
       const validation = validateDOI(currentDoi);
-      if (!validation.valid) {
-        log.warn(`Invalid DOI format: ${currentDoi}. Error: ${validation.error}`);
-        results.push({ doi: currentDoi, status: "invalid", error: validation.error });
-        invalidCount++;
-        continue;
-      }
+      if (!validation.valid) {}
 
       const normalizedDoi = validation.normalized;
killedBy: Worker addDOI endpoint should handle a mix of valid, invalid, and duplicate DOIs
statusReason: expected 'Processed 4 DOIs: 3 added, 1 already …' to be 'Processed 4 DOIs: 2 added, 1 already …' // Object.is equality

[Killed] StringLiteral
src/worker.js:330:49
       const validation = validateDOI(currentDoi);
       if (!validation.valid) {
         log.warn(`Invalid DOI format: ${currentDoi}. Error: ${validation.error}`);
-        results.push({ doi: currentDoi, status: "invalid", error: validation.error });
+        results.push({ doi: currentDoi, status: "", error: validation.error });
         invalidCount++;
         continue;
killedBy: Worker addDOI endpoint should handle a mix of valid, invalid, and duplicate DOIs
statusReason: expected +0 to be 1 // Object.is equality

[Killed] UpdateOperator
src/worker.js:331:9
       if (!validation.valid) {
         log.warn(`Invalid DOI format: ${currentDoi}. Error: ${validation.error}`);
         results.push({ doi: currentDoi, status: "invalid", error: validation.error });
-        invalidCount++;
+        invalidCount--;
         continue;
       }
killedBy: Worker addDOI endpoint should handle a mix of valid, invalid, and duplicate DOIs
statusReason: expected 'Processed 4 DOIs: 2 added, 1 already …' to be 'Processed 4 DOIs: 2 added, 1 already …' // Object.is equality

[Killed] ConditionalExpression
src/worker.js:336:11
       }
 
       const normalizedDoi = validation.normalized;
-      if (!doiList.includes(normalizedDoi)) {
+      if (true) {
         doiList.push(normalizedDoi);
         results.push({ doi: currentDoi, normalized: normalizedDoi, status: "added" });
killedBy: Worker addDOI endpoint should handle a mix of valid, invalid, and duplicate DOIs
statusReason: expected 'Processed 4 DOIs: 3 added, 0 already …' to be 'Processed 4 DOIs: 2 added, 1 already …' // Object.is equality

[Killed] ConditionalExpression
src/worker.js:336:11
       }
 
       const normalizedDoi = validation.normalized;
-      if (!doiList.includes(normalizedDoi)) {
+      if (false) {
         doiList.push(normalizedDoi);
         results.push({ doi: currentDoi, normalized: normalizedDoi, status: "added" });
killedBy: Worker addDOI endpoint should add a list of valid DOIs
statusReason: expected 'Processed 2 DOIs: 0 added, 2 already …' to be 'Processed 2 DOIs: 2 added, 0 already …' // Object.is equality

[Killed] ObjectLiteral
src/worker.js:338:22
       const normalizedDoi = validation.normalized;
       if (!doiList.includes(normalizedDoi)) {
         doiList.push(normalizedDoi);
-        results.push({ doi: currentDoi, normalized: normalizedDoi, status: "added" });
+        results.push({});
         addedCount++;
         log.info(`DOI added: ${currentDoi} (normalized: ${normalizedDoi})`);
killedBy: Worker addDOI endpoint should add a list of valid DOIs
statusReason: expected [] to deeply equal ArrayContaining{…}

[Killed] UpdateOperator
src/worker.js:339:9
       if (!doiList.includes(normalizedDoi)) {
         doiList.push(normalizedDoi);
         results.push({ doi: currentDoi, normalized: normalizedDoi, status: "added" });
-        addedCount++;
+        addedCount--;
         log.info(`DOI added: ${currentDoi} (normalized: ${normalizedDoi})`);
       } else {
killedBy: Worker addDOI endpoint should add a list of valid DOIs
statusReason: expected 'Processed 2 DOIs: -2 added, 0 already…' to be 'Processed 2 DOIs: 2 added, 0 already …' // Object.is equality

[Survived] StringLiteral
src/worker.js:340:18
         doiList.push(normalizedDoi);
         results.push({ doi: currentDoi, normalized: normalizedDoi, status: "added" });
         addedCount++;
-        log.info(`DOI added: ${currentDoi} (normalized: ${normalizedDoi})`);
+        log.info(``);
       } else {
         results.push({ doi: currentDoi, normalized: normalizedDoi, status: "already_existed" });

[Killed] BlockStatement
src/worker.js:341:14
         results.push({ doi: currentDoi, normalized: normalizedDoi, status: "added" });
         addedCount++;
         log.info(`DOI added: ${currentDoi} (normalized: ${normalizedDoi})`);
-      } else {
-        results.push({ doi: currentDoi, normalized: normalizedDoi, status: "already_existed" });
-        alreadyExistedCount++;
-        log.info(`DOI already exists: ${currentDoi} (normalized: ${normalizedDoi})`);
-      }
+      } else {}
     }
 
killedBy: Worker addDOI endpoint should handle a mix of valid, invalid, and duplicate DOIs
statusReason: expected 'Processed 4 DOIs: 2 added, 0 already …' to be 'Processed 4 DOIs: 2 added, 1 already …' // Object.is equality

[Killed] ObjectLiteral
src/worker.js:342:22
         addedCount++;
         log.info(`DOI added: ${currentDoi} (normalized: ${normalizedDoi})`);
       } else {
-        results.push({ doi: currentDoi, normalized: normalizedDoi, status: "already_existed" });
+        results.push({});
         alreadyExistedCount++;
         log.info(`DOI already exists: ${currentDoi} (normalized: ${normalizedDoi})`);
killedBy: Worker addDOI endpoint should handle a mix of valid, invalid, and duplicate DOIs
statusReason: expected +0 to be 1 // Object.is equality

[Killed] UpdateOperator
src/worker.js:343:9
         log.info(`DOI added: ${currentDoi} (normalized: ${normalizedDoi})`);
       } else {
         results.push({ doi: currentDoi, normalized: normalizedDoi, status: "already_existed" });
-        alreadyExistedCount++;
+        alreadyExistedCount--;
         log.info(`DOI already exists: ${currentDoi} (normalized: ${normalizedDoi})`);
       }
killedBy: Worker addDOI endpoint should handle a mix of valid, invalid, and duplicate DOIs
statusReason: expected 'Processed 4 DOIs: 2 added, -1 already…' to be 'Processed 4 DOIs: 2 added, 1 already …' // Object.is equality

[Survived] StringLiteral
src/worker.js:344:18
       } else {
         results.push({ doi: currentDoi, normalized: normalizedDoi, status: "already_existed" });
         alreadyExistedCount++;
-        log.info(`DOI already exists: ${currentDoi} (normalized: ${normalizedDoi})`);
+        log.info(``);
       }
     }

[Killed] BlockStatement
src/worker.js:348:25
       }
     }
 
-    if (addedCount > 0) {
-      await env.DOIS.put(DOI_CONFIG.DOI_LIST_KEY, JSON.stringify(doiList));
-    }
+    if (addedCount > 0) {}
 
     const message = `Processed ${doisToAdd.length} DOIs: ${addedCount} added, ${alreadyExistedCount} already existed, ${invalidCount} invalid.`;
killedBy: Worker addDOI endpoint should add a list of valid DOIs
statusReason: expected "spy" to be called with arguments: [ 'doi-list', …(1) ]

Number of calls: 0

[Killed] EqualityOperator
src/worker.js:348:9
       }
     }
 
-    if (addedCount > 0) {
+    if (addedCount <= 0) {
       await env.DOIS.put(DOI_CONFIG.DOI_LIST_KEY, JSON.stringify(doiList));
     }
killedBy: Worker addDOI endpoint should add a list of valid DOIs
statusReason: expected "spy" to be called with arguments: [ 'doi-list', …(1) ]

Number of calls: 0

[Killed] StringLiteral
src/worker.js:352:21
       await env.DOIS.put(DOI_CONFIG.DOI_LIST_KEY, JSON.stringify(doiList));
     }
 
-    const message = `Processed ${doisToAdd.length} DOIs: ${addedCount} added, ${alreadyExistedCount} already existed, ${invalidCount} invalid.`;
+    const message = ``;
     log.info(message);
 
killedBy: Worker addDOI endpoint should add a list of valid DOIs
statusReason: expected '' to be 'Processed 2 DOIs: 2 added, 0 already …' // Object.is equality

[Survived] ObjectLiteral
src/worker.js:362:18
       }),
       {
         status: 200, // Or 207 for Multi-Status if some failed, but 200 is fine with detailed results
-        headers: { "Content-Type": "application/json" },
+        headers: {},
       }
     );

[Survived] StringLiteral
src/worker.js:362:36
       }),
       {
         status: 200, // Or 207 for Multi-Status if some failed, but 200 is fine with detailed results
-        headers: { "Content-Type": "application/json" },
+        headers: { "Content-Type": "" },
       }
     );

[Killed] BlockStatement
src/worker.js:365:19
         headers: { "Content-Type": "application/json" },
       }
     );
-  } catch (error) {
-    log.error("Error in addDOI", { error: error.message });
-    return createErrorResponse(error);
-  }
+  } catch (error) {}
 }
 
killedBy: Worker addDOI endpoint should return 400 for invalid JSON format (not an array)
statusReason: Cannot read properties of undefined (reading 'status')

[NoCoverage] BlockStatement
src/worker.js:387:15
 
     const { doi } = body;
 
-    if (!doi) {
-      throw new ValidationError("DOI is required");
-    }
+    if (!doi) {}
 
     log.info(`Removing DOI: ${doi}`);

[NoCoverage] ConditionalExpression
src/worker.js:387:9
 
     const { doi } = body;
 
-    if (!doi) {
+    if (true) {
       throw new ValidationError("DOI is required");
     }

[NoCoverage] ConditionalExpression
src/worker.js:396:9
     // Get current list
     const doiListJson = await env.DOIS.get(DOI_CONFIG.DOI_LIST_KEY);
 
-    if (!doiListJson) {
+    if (false) {
       throw new NotFoundError("No DOIs configured");
     }

[NoCoverage] BooleanLiteral
src/worker.js:396:9
     // Get current list
     const doiListJson = await env.DOIS.get(DOI_CONFIG.DOI_LIST_KEY);
 
-    if (!doiListJson) {
+    if (doiListJson) {
       throw new NotFoundError("No DOIs configured");
     }

[NoCoverage] StringLiteral
src/worker.js:397:31
     const doiListJson = await env.DOIS.get(DOI_CONFIG.DOI_LIST_KEY);
 
     if (!doiListJson) {
-      throw new NotFoundError("No DOIs configured");
+      throw new NotFoundError("");
     }
 

[NoCoverage] ConditionalExpression
src/worker.js:403:9
     const doiList = doiListJson ? JSON.parse(doiListJson) : [];
 
     // Check if DOI exists
-    if (!doiList.includes(doi)) {
+    if (true) {
       throw new NotFoundError(`DOI ${doi} not found in monitoring list`);
     }

[NoCoverage] BlockStatement
src/worker.js:403:33
     const doiList = doiListJson ? JSON.parse(doiListJson) : [];
 
     // Check if DOI exists
-    if (!doiList.includes(doi)) {
-      throw new NotFoundError(`DOI ${doi} not found in monitoring list`);
-    }
+    if (!doiList.includes(doi)) {}
 
     // Remove DOI

[NoCoverage] ConditionalExpression
src/worker.js:408:47
     }
 
     // Remove DOI
-    const updatedList = doiList.filter((d) => d !== doi);
+    const updatedList = doiList.filter((d) => false);
     await env.DOIS.put(DOI_CONFIG.DOI_LIST_KEY, JSON.stringify(updatedList));
 

[NoCoverage] ArrowFunction
src/worker.js:408:40
     }
 
     // Remove DOI
-    const updatedList = doiList.filter((d) => d !== doi);
+    const updatedList = doiList.filter(() => undefined);
     await env.DOIS.put(DOI_CONFIG.DOI_LIST_KEY, JSON.stringify(updatedList));
 

[NoCoverage] StringLiteral
src/worker.js:414:14
     // Clean up status
     await env.STATUS.delete(doi);
 
-    log.info(`DOI removed: ${doi}`);
+    log.info(``);
 
     return new Response(

[NoCoverage] ObjectLiteral
src/worker.js:421:7
         message: `DOI ${doi} removed from monitoring list`,
         doi: doi,
       }),
-      {
-        status: 200,
-        headers: { "Content-Type": "application/json" },
-      }
+      {}
     );
   } catch (error) {

[NoCoverage] ObjectLiteral
src/worker.js:423:18
       }),
       {
         status: 200,
-        headers: { "Content-Type": "application/json" },
+        headers: {},
       }
     );

[NoCoverage] BlockStatement
src/worker.js:426:19
         headers: { "Content-Type": "application/json" },
       }
     );
-  } catch (error) {
-    log.error("Error in removeDOI", { error: error.message });
-    return createErrorResponse(error);
-  }
+  } catch (error) {}
 }
 

[NoCoverage] ObjectLiteral
src/worker.js:427:37
       }
     );
   } catch (error) {
-    log.error("Error in removeDOI", { error: error.message });
+    log.error("Error in removeDOI", {});
     return createErrorResponse(error);
   }

[Survived] StringLiteral
src/worker.js:440:14
  */
 async function getStatus(env, log) {
   try {
-    log.info("Getting DOI status");
+    log.info("");
     const doiListJson = await env.DOIS.get(DOI_CONFIG.DOI_LIST_KEY);
 

[Killed] ConditionalExpression
src/worker.js:443:9
     log.info("Getting DOI status");
     const doiListJson = await env.DOIS.get(DOI_CONFIG.DOI_LIST_KEY);
 
-    if (!doiListJson) {
+    if (true) {
       return new Response(JSON.stringify({ dois: [], count: 0 }), {
         headers: { "Content-Type": "application/json" },
killedBy: Worker Timestamp Logic GET /status endpoint includes new timestamp fields in the response
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/worker.js:456:11
       const statusJson = await env.STATUS.get(doi);
       let status;
 
-      try {
-        status = statusJson
-          ? JSON.parse(statusJson)
-          : {
-              working: null,
-              lastCheck: null,
-              firstCheckedTimestamp: null,
-              firstFailureTimestamp: null,
-              firstSuccessTimestamp: null
-            }; // Initialize with null for new fields if no status found
-      } catch (error) {
+      try {} catch (error) {
         log.warn(`Error parsing status for DOI ${doi}`, {
           error: error.message,
killedBy: Worker Timestamp Logic GET /status endpoint includes new timestamp fields in the response
statusReason: expected undefined to be '2025-08-19T07:20:32.421Z' // Object.is equality

[NoCoverage] BlockStatement
src/worker.js:466:23
               firstFailureTimestamp: null,
               firstSuccessTimestamp: null
             }; // Initialize with null for new fields if no status found
-      } catch (error) {
-        log.warn(`Error parsing status for DOI ${doi}`, {
-          error: error.message,
-        });
-        status = {
-          working: null,
-          lastCheck: null,
-          firstCheckedTimestamp: null,
-          firstFailureTimestamp: null,
-          firstSuccessTimestamp: null,
-          error: "Status data corrupted",
-        };
-      }
+      } catch (error) {}
 
       statuses.push({

[NoCoverage] StringLiteral
src/worker.js:476:18
           firstCheckedTimestamp: null,
           firstFailureTimestamp: null,
           firstSuccessTimestamp: null,
-          error: "Status data corrupted",
+          error: "",
         };
       }

[Survived] MethodExpression
src/worker.js:489:16
     const response = {
       dois: statuses,
       count: doiList.length,
-      working: statuses.filter((s) => s.working).length,
+      working: statuses.length,
       broken: statuses.filter((s) => s.working === false).length,
       unchecked: statuses.filter((s) => s.working === null).length,

[Survived] ArrowFunction
src/worker.js:489:32
     const response = {
       dois: statuses,
       count: doiList.length,
-      working: statuses.filter((s) => s.working).length,
+      working: statuses.filter(() => undefined).length,
       broken: statuses.filter((s) => s.working === false).length,
       unchecked: statuses.filter((s) => s.working === null).length,

[Survived] EqualityOperator
src/worker.js:490:38
       dois: statuses,
       count: doiList.length,
       working: statuses.filter((s) => s.working).length,
-      broken: statuses.filter((s) => s.working === false).length,
+      broken: statuses.filter((s) => s.working !== false).length,
       unchecked: statuses.filter((s) => s.working === null).length,
     };

[Survived] ConditionalExpression
src/worker.js:490:38
       dois: statuses,
       count: doiList.length,
       working: statuses.filter((s) => s.working).length,
-      broken: statuses.filter((s) => s.working === false).length,
+      broken: statuses.filter((s) => false).length,
       unchecked: statuses.filter((s) => s.working === null).length,
     };

[Survived] EqualityOperator
src/worker.js:491:41
       count: doiList.length,
       working: statuses.filter((s) => s.working).length,
       broken: statuses.filter((s) => s.working === false).length,
-      unchecked: statuses.filter((s) => s.working === null).length,
+      unchecked: statuses.filter((s) => s.working !== null).length,
     };
 

[Survived] ArrowFunction
src/worker.js:491:34
       count: doiList.length,
       working: statuses.filter((s) => s.working).length,
       broken: statuses.filter((s) => s.working === false).length,
-      unchecked: statuses.filter((s) => s.working === null).length,
+      unchecked: statuses.filter(() => undefined).length,
     };
 

[Survived] StringLiteral
src/worker.js:494:14
       unchecked: statuses.filter((s) => s.working === null).length,
     };
 
-    log.info(`Retrieved status for ${doiList.length} DOIs`);
+    log.info(``);
 
     return new Response(JSON.stringify(response), {

[Survived] ObjectLiteral
src/worker.js:497:16
     log.info(`Retrieved status for ${doiList.length} DOIs`);
 
     return new Response(JSON.stringify(response), {
-      headers: { "Content-Type": "application/json" },
+      headers: {},
     });
   } catch (error) {

[NoCoverage] BlockStatement
src/worker.js:499:19
     return new Response(JSON.stringify(response), {
       headers: { "Content-Type": "application/json" },
     });
-  } catch (error) {
-    log.error("Error in getStatus", { error: error.message });
-    return createErrorResponse(error);
-  }
+  } catch (error) {}
 }
 
