[Killed] BlockStatement
src/lib/errors.js:10:38
  * Base class for application-specific errors
  */
 export class AppError extends Error {
-  constructor(message, options = {}) {
-    super(message);
-    this.name = this.constructor.name;
-    this.status = options.status || 500;
-    this.code = options.code || 'INTERNAL_ERROR';
-    this.context = options.context || {};
-    this.cause = options.cause;
-    
-    // Maintains proper stack trace for where error was thrown
-    if (Error.captureStackTrace) {
-      Error.captureStackTrace(this, this.constructor);
-    }
-  }
+  constructor(message, options = {}) {}
   
   /**
killedBy: Worker addDOI endpoint should return 400 for invalid JSON format (not an array)
statusReason: expected 500 to be 400 // Object.is equality

[Killed] LogicalOperator
src/lib/errors.js:13:19
   constructor(message, options = {}) {
     super(message);
     this.name = this.constructor.name;
-    this.status = options.status || 500;
+    this.status = options.status && 500;
     this.code = options.code || 'INTERNAL_ERROR';
     this.context = options.context || {};
killedBy: Worker addDOI endpoint should return 400 for invalid JSON format (not an array)
statusReason: expected 500 to be 400 // Object.is equality

[Killed] ConditionalExpression
src/lib/errors.js:13:19
   constructor(message, options = {}) {
     super(message);
     this.name = this.constructor.name;
-    this.status = options.status || 500;
+    this.status = true;
     this.code = options.code || 'INTERNAL_ERROR';
     this.context = options.context || {};
killedBy: Worker addDOI endpoint should return 400 for invalid JSON format (not an array)
statusReason: expected 500 to be 400 // Object.is equality

[Killed] LogicalOperator
src/lib/errors.js:14:17
     super(message);
     this.name = this.constructor.name;
     this.status = options.status || 500;
-    this.code = options.code || 'INTERNAL_ERROR';
+    this.code = options.code && 'INTERNAL_ERROR';
     this.context = options.context || {};
     this.cause = options.cause;
killedBy: errors.js AppError should instantiate with default options
statusReason: expected undefined to be 'INTERNAL_ERROR' // Object.is equality

[Killed] ConditionalExpression
src/lib/errors.js:14:17
     super(message);
     this.name = this.constructor.name;
     this.status = options.status || 500;
-    this.code = options.code || 'INTERNAL_ERROR';
+    this.code = true;
     this.context = options.context || {};
     this.cause = options.cause;
killedBy: errors.js AppError should instantiate with default options
statusReason: expected true to be 'INTERNAL_ERROR' // Object.is equality

[Killed] ConditionalExpression
src/lib/errors.js:15:20
     this.name = this.constructor.name;
     this.status = options.status || 500;
     this.code = options.code || 'INTERNAL_ERROR';
-    this.context = options.context || {};
+    this.context = false;
     this.cause = options.cause;
     
killedBy: errors.js AppError should instantiate with default options
statusReason: expected false to deeply equal {}

[Killed] LogicalOperator
src/lib/errors.js:15:20
     this.name = this.constructor.name;
     this.status = options.status || 500;
     this.code = options.code || 'INTERNAL_ERROR';
-    this.context = options.context || {};
+    this.context = options.context && {};
     this.cause = options.cause;
     
killedBy: errors.js AppError should instantiate with default options
statusReason: expected undefined to deeply equal {}

[Survived] ConditionalExpression
src/lib/errors.js:19:9
     this.cause = options.cause;
     
     // Maintains proper stack trace for where error was thrown
-    if (Error.captureStackTrace) {
+    if (false) {
       Error.captureStackTrace(this, this.constructor);
     }

[Survived] ConditionalExpression
src/lib/errors.js:19:9
     this.cause = options.cause;
     
     // Maintains proper stack trace for where error was thrown
-    if (Error.captureStackTrace) {
+    if (true) {
       Error.captureStackTrace(this, this.constructor);
     }

[Killed] BlockStatement
src/lib/errors.js:28:16
    * Format the error for API response
    * @returns {Object} - Error response object
    */
-  toResponse() {
-    return {
-      error: {
-        message: this.message,
-        code: this.code,
-        ...(process.env.NODE_ENV !== 'production' ? { context: this.context } : {})
-      }
-    };
-  }
+  toResponse() {}
 }
 
killedBy: errors.js AppError toResponse() should return basic error response structure
statusReason: expected undefined to deeply equal { error: { …(3) } }

[Killed] ConditionalExpression
src/lib/errors.js:33:13
       error: {
         message: this.message,
         code: this.code,
-        ...(process.env.NODE_ENV !== 'production' ? { context: this.context } : {})
+        ...(false ? { context: this.context } : {})
       }
     };
killedBy: errors.js AppError toResponse() should return basic error response structure
statusReason: expected { error: { …(2) } } to deeply equal { error: { …(3) } }

[Killed] ConditionalExpression
src/lib/errors.js:33:13
       error: {
         message: this.message,
         code: this.code,
-        ...(process.env.NODE_ENV !== 'production' ? { context: this.context } : {})
+        ...(true ? { context: this.context } : {})
       }
     };
killedBy: errors.js AppError toResponse() should exclude context when NODE_ENV is "production"
statusReason: expected { debug: true } to be undefined

[Killed] BlockStatement
src/lib/errors.js:43:38
  * Error for validation failures
  */
 export class ValidationError extends AppError {
-  constructor(message, options = {}) {
-    super(message, { 
-      status: 400, 
-      code: 'VALIDATION_ERROR',
-      ...options 
-    });
-  }
+  constructor(message, options = {}) {}
 }
 
killedBy: errors.js Derived Error Classes ValidationError should instantiate with default status and code
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] ObjectLiteral
src/lib/errors.js:44:20
  */
 export class ValidationError extends AppError {
   constructor(message, options = {}) {
-    super(message, { 
-      status: 400, 
-      code: 'VALIDATION_ERROR',
-      ...options 
-    });
+    super(message, {});
   }
 }
killedBy: errors.js Derived Error Classes ValidationError should instantiate with default status and code
statusReason: expected 500 to be 400 // Object.is equality

[Killed] BlockStatement
src/lib/errors.js:56:38
  * Error for not found resources
  */
 export class NotFoundError extends AppError {
-  constructor(message, options = {}) {
-    super(message || 'Resource not found', { 
-      status: 404, 
-      code: 'NOT_FOUND',
-      ...options 
-    });
-  }
+  constructor(message, options = {}) {}
 }
 
killedBy: errors.js Derived Error Classes NotFoundError should instantiate with default status and code
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] LogicalOperator
src/lib/errors.js:57:11
  */
 export class NotFoundError extends AppError {
   constructor(message, options = {}) {
-    super(message || 'Resource not found', { 
+    super(message && 'Resource not found', { 
       status: 404, 
       code: 'NOT_FOUND',
killedBy: errors.js Derived Error Classes NotFoundError should pass custom options to AppError
statusReason: expected 'Resource not found' to be 'Custom not found error' // Object.is equality

[Killed] ConditionalExpression
src/lib/errors.js:57:11
  */
 export class NotFoundError extends AppError {
   constructor(message, options = {}) {
-    super(message || 'Resource not found', { 
+    super(false, { 
       status: 404, 
       code: 'NOT_FOUND',
killedBy: errors.js Derived Error Classes NotFoundError should instantiate with default status and code
statusReason: expected 'false' to be 'Resource not found' // Object.is equality

[Killed] BlockStatement
src/lib/errors.js:69:38
  * Error for external service failures
  */
 export class ExternalServiceError extends AppError {
-  constructor(message, options = {}) {
-    super(message, { 
-      status: 502, 
-      code: 'EXTERNAL_SERVICE_ERROR',
-      ...options 
-    });
-  }
+  constructor(message, options = {}) {}
 }
 
killedBy: errors.js Derived Error Classes ExternalServiceError should instantiate with default status and code
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
src/lib/errors.js:83:39
  * @param {Function} fn - The function to wrap
  * @returns {Function} - Wrapped function with error handling
  */
-export function withErrorHandling(fn) {
-  return async (...args) => {
-    try {
-      return await fn(...args);
-    } catch (error) {
-      // If it's already an AppError, pass it through
-      if (error instanceof AppError) {
-        throw error;
-      }
-      
-      // Otherwise, wrap it in an AppError
-      throw new AppError(error.message, {
-        cause: error,
-        context: { args: args.map(arg => String(arg).substring(0, 100)) }
-      });
-    }
-  };
-}
+export function withErrorHandling(fn) {}
 
 /**
killedBy: errors.js withErrorHandling should return result when wrapped function succeeds
statusReason: wrappedSyncFn is not a function

[Killed] BlockStatement
src/lib/errors.js:84:29
  * @returns {Function} - Wrapped function with error handling
  */
 export function withErrorHandling(fn) {
-  return async (...args) => {
-    try {
-      return await fn(...args);
-    } catch (error) {
-      // If it's already an AppError, pass it through
-      if (error instanceof AppError) {
-        throw error;
-      }
-      
-      // Otherwise, wrap it in an AppError
-      throw new AppError(error.message, {
-        cause: error,
-        context: { args: args.map(arg => String(arg).substring(0, 100)) }
-      });
-    }
-  };
+  return async (...args) => {};
 }
 
killedBy: errors.js withErrorHandling should return result when wrapped function succeeds
statusReason: expected undefined to be 5 // Object.is equality

[Killed] BlockStatement
src/lib/errors.js:85:9
  */
 export function withErrorHandling(fn) {
   return async (...args) => {
-    try {
-      return await fn(...args);
-    } catch (error) {
+    try {} catch (error) {
       // If it's already an AppError, pass it through
       if (error instanceof AppError) {
killedBy: errors.js withErrorHandling should return result when wrapped function succeeds
statusReason: expected undefined to be 5 // Object.is equality

[Killed] BlockStatement
src/lib/errors.js:87:21
   return async (...args) => {
     try {
       return await fn(...args);
-    } catch (error) {
-      // If it's already an AppError, pass it through
-      if (error instanceof AppError) {
-        throw error;
-      }
-      
-      // Otherwise, wrap it in an AppError
-      throw new AppError(error.message, {
-        cause: error,
-        context: { args: args.map(arg => String(arg).substring(0, 100)) }
-      });
-    }
+    } catch (error) {}
   };
 }
killedBy: errors.js withErrorHandling should wrap generic Error in AppError with context
statusReason: expected Error: Expected wrappedSyncFn to throw to be an instance of AppError

[Killed] ConditionalExpression
src/lib/errors.js:89:11
       return await fn(...args);
     } catch (error) {
       // If it's already an AppError, pass it through
-      if (error instanceof AppError) {
+      if (true) {
         throw error;
       }
killedBy: errors.js withErrorHandling should wrap generic Error in AppError with context
statusReason: expected Error: Something went wrong to be an instance of AppError

[Killed] ConditionalExpression
src/lib/errors.js:89:11
       return await fn(...args);
     } catch (error) {
       // If it's already an AppError, pass it through
-      if (error instanceof AppError) {
+      if (false) {
         throw error;
       }
killedBy: errors.js withErrorHandling should re-throw AppError as is
statusReason: expected AppError: Custom AppError { …(3) } to be AppError: Custom AppError { …(3) } // Object.is equality

[Killed] ArrowFunction
src/lib/errors.js:96:35
       // Otherwise, wrap it in an AppError
       throw new AppError(error.message, {
         cause: error,
-        context: { args: args.map(arg => String(arg).substring(0, 100)) }
+        context: { args: args.map(() => undefined) }
       });
     }
killedBy: errors.js withErrorHandling should wrap generic Error in AppError with context
statusReason: expected [ undefined, undefined ] to deeply equal [ '2', '3' ]

[Survived] MethodExpression
src/lib/errors.js:96:42
       // Otherwise, wrap it in an AppError
       throw new AppError(error.message, {
         cause: error,
-        context: { args: args.map(arg => String(arg).substring(0, 100)) }
+        context: { args: args.map(arg => String(arg)) }
       });
     }

[Killed] BlockStatement
src/lib/errors.js:107:44
  * @param {Error} error - The error to format
  * @returns {Response} - Formatted error response
  */
-export function createErrorResponse(error) {
-  const status = error instanceof AppError ? error.status : 500;
-  const body = error instanceof AppError 
-    ? error.toResponse()
-    : { error: { message: 'An unexpected error occurred', code: 'INTERNAL_ERROR' } };
-  
-  return new Response(JSON.stringify(body), {
-    status,
-    headers: { 'Content-Type': 'application/json' }
-  });
-}
+export function createErrorResponse(error) {}
 
 /**
killedBy: errors.js createErrorResponse should create response for AppError
statusReason: expected undefined to be an instance of Response

[Killed] ObjectLiteral
src/lib/errors.js:111:16
   const status = error instanceof AppError ? error.status : 500;
   const body = error instanceof AppError 
     ? error.toResponse()
-    : { error: { message: 'An unexpected error occurred', code: 'INTERNAL_ERROR' } };
+    : { error: {} };
   
   return new Response(JSON.stringify(body), {
killedBy: errors.js createErrorResponse should create response for generic Error
statusReason: expected { error: {} } to deeply equal { error: { …(2) } }

[Killed] StringLiteral
src/lib/errors.js:111:65
   const status = error instanceof AppError ? error.status : 500;
   const body = error instanceof AppError 
     ? error.toResponse()
-    : { error: { message: 'An unexpected error occurred', code: 'INTERNAL_ERROR' } };
+    : { error: { message: 'An unexpected error occurred', code: "" } };
   
   return new Response(JSON.stringify(body), {
killedBy: errors.js createErrorResponse should create response for generic Error
statusReason: expected { error: { …(2) } } to deeply equal { error: { …(2) } }

[Killed] ObjectLiteral
src/lib/errors.js:115:14
   
   return new Response(JSON.stringify(body), {
     status,
-    headers: { 'Content-Type': 'application/json' }
+    headers: {}
   });
 }
killedBy: errors.js createErrorResponse should create response for AppError
statusReason: expected 'text/plain;charset=UTF-8' to be 'application/json' // Object.is equality

[Killed] BlockStatement
src/lib/errors.js:124:46
  * @param {Error} error - The error to format
  * @returns {Object} - Formatted error object for logging
  */
-export function formatErrorForLogging(error) {
-  return {
-    name: error.name,
-    message: error.message,
-    stack: error.stack,
-    ...(error instanceof AppError ? { 
-      status: error.status,
-      code: error.code,
-      context: error.context
-    } : {}),
-    ...(error.cause ? { cause: formatErrorForLogging(error.cause) } : {})
-  };
-}
+export function formatErrorForLogging(error) {}
 
 /**
killedBy: errors.js formatErrorForLogging should format generic Error
statusReason: expected undefined to deeply equal { name: 'Error', …(2) }

[Killed] BlockStatement
src/lib/errors.js:145:74
  * @returns {Object} - Parsed object
  * @throws {ValidationError} - If parsing fails
  */
-export function safeJsonParse(jsonString, errorMessage = 'Invalid JSON') {
-  try {
-    return JSON.parse(jsonString);
-  } catch (error) {
-    throw new ValidationError(errorMessage, { cause: error });
-  }
-}
+export function safeJsonParse(jsonString, errorMessage = 'Invalid JSON') {}
killedBy: errors.js safeJsonParse should parse valid JSON string
statusReason: expected undefined to deeply equal { name: 'John Doe', age: 30 }

[Killed] BlockStatement
src/lib/errors.js:146:7
  * @throws {ValidationError} - If parsing fails
  */
 export function safeJsonParse(jsonString, errorMessage = 'Invalid JSON') {
-  try {
-    return JSON.parse(jsonString);
-  } catch (error) {
+  try {} catch (error) {
     throw new ValidationError(errorMessage, { cause: error });
   }
killedBy: errors.js safeJsonParse should parse valid JSON string
statusReason: expected undefined to deeply equal { name: 'John Doe', age: 30 }

[Killed] BlockStatement
src/lib/errors.js:148:19
 export function safeJsonParse(jsonString, errorMessage = 'Invalid JSON') {
   try {
     return JSON.parse(jsonString);
-  } catch (error) {
-    throw new ValidationError(errorMessage, { cause: error });
-  }
+  } catch (error) {}
 }
killedBy: errors.js safeJsonParse should throw ValidationError for invalid JSON string
statusReason: expected Error: safeJsonParse should have thrown a… to be an instance of ValidationError

[Killed] ObjectLiteral
src/lib/errors.js:149:45
   try {
     return JSON.parse(jsonString);
   } catch (error) {
-    throw new ValidationError(errorMessage, { cause: error });
+    throw new ValidationError(errorMessage, {});
   }
 }
killedBy: errors.js safeJsonParse should throw ValidationError for invalid JSON string
statusReason: expected undefined to be an instance of Error
