[Survived] BooleanLiteral
src/lib/logger.js:17:13
 // Default configuration
 const defaultConfig = {
   minLevel: LOG_LEVELS.INFO,
-  colorize: true,
+  colorize: false,
   timestamps: true,
   includeContext: true

[Survived] BooleanLiteral
src/lib/logger.js:18:15
 const defaultConfig = {
   minLevel: LOG_LEVELS.INFO,
   colorize: true,
-  timestamps: true,
+  timestamps: false,
   includeContext: true
 };

[Survived] BooleanLiteral
src/lib/logger.js:19:19
   minLevel: LOG_LEVELS.INFO,
   colorize: true,
   timestamps: true,
-  includeContext: true
+  includeContext: false
 };
 

[Killed] BlockStatement
src/lib/logger.js:33:40
  * @param {boolean} config.timestamps - Whether to include timestamps
  * @param {boolean} config.includeContext - Whether to include context information
  */
-export function configure(config = {}) {
-  loggerConfig = { ...defaultConfig, ...config };
-}
+export function configure(config = {}) {}
 
 /**
killedBy: logger.js configure should override default configuration
statusReason: expected "debug" to be called 1 times, but got 0 times

[Killed] ArrayDeclaration
src/lib/logger.js:45:17
  * @returns {string} - Formatted log message
  */
 function formatLogMessage(level, message, context = {}) {
-  const parts = [];
+  const parts = ["Stryker was here"];
   
   // Add timestamp if enabled
killedBy: logger.js configure should override default configuration
statusReason: expected 'Stryker was here [2025-08-19T07:20:09…' to match /^\[\d{4}-\d{2}-\d{2}T\d{2}:\d{2}:\d{2…/

[Killed] ConditionalExpression
src/lib/logger.js:48:7
   const parts = [];
   
   // Add timestamp if enabled
-  if (loggerConfig.timestamps) {
+  if (true) {
     parts.push(`[${new Date().toISOString()}]`);
   }
killedBy: logger.js formatLogMessage (tested via public log functions) should exclude timestamp when configured
statusReason: expected "info" to be called with arguments: [ '[INFO] Message without timestamp' ]

Received: 

  1st info call:

  [
-   "[INFO] Message without timestamp",

[Killed] BlockStatement
src/lib/logger.js:48:32
   const parts = [];
   
   // Add timestamp if enabled
-  if (loggerConfig.timestamps) {
-    parts.push(`[${new Date().toISOString()}]`);
-  }
+  if (loggerConfig.timestamps) {}
   
   // Add log level
killedBy: logger.js configure should override default configuration
statusReason: expected '[DEBUG]' to match /^\[\d{4}-\d{2}-\d{2}T\d{2}:\d{2}:\d{2…/

[Killed] StringLiteral
src/lib/logger.js:53:14
   }
   
   // Add log level
-  parts.push(`[${level}]`);
+  parts.push(``);
   
   // Add message
killedBy: logger.js configure should apply default configuration (implicitly tested by resetLoggerConfig)
statusReason: expected "info" to be called with arguments: [ StringContaining{…} ]

Received: 

  1st info call:

  [
-   StringContaining "[INFO] Test message",

[Killed] LogicalOperator
src/lib/logger.js:59:7
   parts.push(message);
   
   // Add context if enabled and available
-  if (loggerConfig.includeContext && Object.keys(context).length > 0) {
+  if (loggerConfig.includeContext || Object.keys(context).length > 0) {
     try {
       const contextStr = JSON.stringify(context);
killedBy: logger.js configure should override default configuration
statusReason: expected '[2025-08-19T07:20:09.612Z] [INFO] Inf…' not to contain '{"test":"context"}'

[Killed] ConditionalExpression
src/lib/logger.js:59:38
   parts.push(message);
   
   // Add context if enabled and available
-  if (loggerConfig.includeContext && Object.keys(context).length > 0) {
+  if (loggerConfig.includeContext && true) {
     try {
       const contextStr = JSON.stringify(context);
killedBy: logger.js formatLogMessage (tested via public log functions) should exclude timestamp when configured
statusReason: expected "info" to be called with arguments: [ '[INFO] Message without timestamp' ]

Received: 

  1st info call:

  [
-   "[INFO] Message without timestamp",

[Killed] BlockStatement
src/lib/logger.js:60:9
   
   // Add context if enabled and available
   if (loggerConfig.includeContext && Object.keys(context).length > 0) {
-    try {
-      const contextStr = JSON.stringify(context);
-      parts.push(`- ${contextStr}`);
-    } catch (error) {
+    try {} catch (error) {
       parts.push('- [Context serialization error]');
     }
killedBy: logger.js formatLogMessage (tested via public log functions) should include context when configured
statusReason: expected "info" to be called with arguments: [ Array(1) ]

Received: 

  1st info call:

  [
-   "[INFO] Message with context - {\"data\":\"value\"}",

[Killed] BlockStatement
src/lib/logger.js:63:21
     try {
       const contextStr = JSON.stringify(context);
       parts.push(`- ${contextStr}`);
-    } catch (error) {
-      parts.push('- [Context serialization error]');
-    }
+    } catch (error) {}
   }
   
killedBy: logger.js formatLogMessage (tested via public log functions) should handle context serialization errors gracefully
statusReason: expected "info" to be called with arguments: [ StringContaining{…} ]

Received: 

  1st info call:

  [
-   StringContaining "[INFO] Message with circular context - [Context serialization error]",

[Killed] StringLiteral
src/lib/logger.js:68:21
     }
   }
   
-  return parts.join(' ');
+  return parts.join("");
 }
 
killedBy: logger.js configure should apply default configuration (implicitly tested by resetLoggerConfig)
statusReason: expected "info" to be called with arguments: [ StringContaining{…} ]

Received: 

  1st info call:

  [
-   StringContaining "[INFO] Test message",

[Killed] BlockStatement
src/lib/logger.js:76:46
  * @param {string} message - Log message
  * @param {Object} context - Additional context
  */
-export function debug(message, context = {}) {
-  if (loggerConfig.minLevel <= LOG_LEVELS.DEBUG) {
-    console.debug(formatLogMessage('DEBUG', message, context));
-  }
-}
+export function debug(message, context = {}) {}
 
 /**
killedBy: logger.js configure should override default configuration
statusReason: expected "debug" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/lib/logger.js:77:50
  * @param {Object} context - Additional context
  */
 export function debug(message, context = {}) {
-  if (loggerConfig.minLevel <= LOG_LEVELS.DEBUG) {
-    console.debug(formatLogMessage('DEBUG', message, context));
-  }
+  if (loggerConfig.minLevel <= LOG_LEVELS.DEBUG) {}
 }
 
killedBy: logger.js configure should override default configuration
statusReason: expected "debug" to be called 1 times, but got 0 times

[Killed] EqualityOperator
src/lib/logger.js:77:7
  * @param {Object} context - Additional context
  */
 export function debug(message, context = {}) {
-  if (loggerConfig.minLevel <= LOG_LEVELS.DEBUG) {
+  if (loggerConfig.minLevel > LOG_LEVELS.DEBUG) {
     console.debug(formatLogMessage('DEBUG', message, context));
   }
killedBy: logger.js configure should override default configuration
statusReason: expected "debug" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/lib/logger.js:87:45
  * @param {string} message - Log message
  * @param {Object} context - Additional context
  */
-export function info(message, context = {}) {
-  if (loggerConfig.minLevel <= LOG_LEVELS.INFO) {
-    console.info(formatLogMessage('INFO', message, context));
-  }
-}
+export function info(message, context = {}) {}
 
 /**
killedBy: logger.js configure should apply default configuration (implicitly tested by resetLoggerConfig)
statusReason: expected "info" to be called with arguments: [ StringContaining{…} ]

Number of calls: 0

[Killed] EqualityOperator
src/lib/logger.js:88:7
  * @param {Object} context - Additional context
  */
 export function info(message, context = {}) {
-  if (loggerConfig.minLevel <= LOG_LEVELS.INFO) {
+  if (loggerConfig.minLevel < LOG_LEVELS.INFO) {
     console.info(formatLogMessage('INFO', message, context));
   }
killedBy: logger.js configure should apply default configuration (implicitly tested by resetLoggerConfig)
statusReason: expected "info" to be called with arguments: [ StringContaining{…} ]

Number of calls: 0

[Killed] ConditionalExpression
src/lib/logger.js:88:7
  * @param {Object} context - Additional context
  */
 export function info(message, context = {}) {
-  if (loggerConfig.minLevel <= LOG_LEVELS.INFO) {
+  if (false) {
     console.info(formatLogMessage('INFO', message, context));
   }
killedBy: logger.js configure should apply default configuration (implicitly tested by resetLoggerConfig)
statusReason: expected "info" to be called with arguments: [ StringContaining{…} ]

Number of calls: 0

[Killed] StringLiteral
src/lib/logger.js:89:35
  */
 export function info(message, context = {}) {
   if (loggerConfig.minLevel <= LOG_LEVELS.INFO) {
-    console.info(formatLogMessage('INFO', message, context));
+    console.info(formatLogMessage("", message, context));
   }
 }
killedBy: logger.js configure should apply default configuration (implicitly tested by resetLoggerConfig)
statusReason: expected "info" to be called with arguments: [ StringContaining{…} ]

Received: 

  1st info call:

  [
-   StringContaining "[INFO] Test message",

[Killed] BlockStatement
src/lib/logger.js:98:45
  * @param {string} message - Log message
  * @param {Object} context - Additional context
  */
-export function warn(message, context = {}) {
-  if (loggerConfig.minLevel <= LOG_LEVELS.WARN) {
-    console.warn(formatLogMessage('WARN', message, context));
-  }
-}
+export function warn(message, context = {}) {}
 
 /**
killedBy: logger.js configure can reset to default configuration by re-calling configure
statusReason: expected "warn" to be called with arguments: [ StringContaining{…} ]

Number of calls: 0

[Killed] ConditionalExpression
src/lib/logger.js:99:7
  * @param {Object} context - Additional context
  */
 export function warn(message, context = {}) {
-  if (loggerConfig.minLevel <= LOG_LEVELS.WARN) {
+  if (true) {
     console.warn(formatLogMessage('WARN', message, context));
   }
killedBy: logger.js configure can reset to default configuration by re-calling configure
statusReason: expected "warn" to not be called at all, but actually been called 1 times

Received: 

  1st warn call:

    Array [
      "[2025-08-19T07:20:11.700Z] [WARN] This should not be logged",

[Killed] BlockStatement
src/lib/logger.js:99:49
  * @param {Object} context - Additional context
  */
 export function warn(message, context = {}) {
-  if (loggerConfig.minLevel <= LOG_LEVELS.WARN) {
-    console.warn(formatLogMessage('WARN', message, context));
-  }
+  if (loggerConfig.minLevel <= LOG_LEVELS.WARN) {}
 }
 
killedBy: logger.js configure can reset to default configuration by re-calling configure
statusReason: expected "warn" to be called with arguments: [ StringContaining{…} ]

Number of calls: 0

[Killed] StringLiteral
src/lib/logger.js:100:35
  */
 export function warn(message, context = {}) {
   if (loggerConfig.minLevel <= LOG_LEVELS.WARN) {
-    console.warn(formatLogMessage('WARN', message, context));
+    console.warn(formatLogMessage("", message, context));
   }
 }
killedBy: logger.js configure can reset to default configuration by re-calling configure
statusReason: expected "warn" to be called with arguments: [ StringContaining{…} ]

Received: 

  1st warn call:

  [
-   StringContaining "[WARN] This should be logged now",

[Killed] BlockStatement
src/lib/logger.js:109:46
  * @param {string} message - Log message
  * @param {Object} context - Additional context
  */
-export function error(message, context = {}) {
-  if (loggerConfig.minLevel <= LOG_LEVELS.ERROR) {
-    console.error(formatLogMessage('ERROR', message, context));
-  }
-}
+export function error(message, context = {}) {}
 
 /**
killedBy: logger.js Logging functions (debug, info, warn, error) error() should log when minLevel is error or lower
statusReason: expected "error" to be called with arguments: [ StringContaining{…} ]

Number of calls: 0

[Killed] EqualityOperator
src/lib/logger.js:110:7
  * @param {Object} context - Additional context
  */
 export function error(message, context = {}) {
-  if (loggerConfig.minLevel <= LOG_LEVELS.ERROR) {
+  if (loggerConfig.minLevel > LOG_LEVELS.ERROR) {
     console.error(formatLogMessage('ERROR', message, context));
   }
killedBy: logger.js Logging functions (debug, info, warn, error) error() should log when minLevel is error or lower
statusReason: expected "error" to be called with arguments: [ StringContaining{…} ]

Number of calls: 0

[Killed] EqualityOperator
src/lib/logger.js:110:7
  * @param {Object} context - Additional context
  */
 export function error(message, context = {}) {
-  if (loggerConfig.minLevel <= LOG_LEVELS.ERROR) {
+  if (loggerConfig.minLevel < LOG_LEVELS.ERROR) {
     console.error(formatLogMessage('ERROR', message, context));
   }
killedBy: logger.js Logging functions (debug, info, warn, error) error() should log when minLevel is error or lower
statusReason: expected "error" to be called with arguments: [ StringContaining{…} ]

Number of calls: 0

[Killed] StringLiteral
src/lib/logger.js:111:36
  */
 export function error(message, context = {}) {
   if (loggerConfig.minLevel <= LOG_LEVELS.ERROR) {
-    console.error(formatLogMessage('ERROR', message, context));
+    console.error(formatLogMessage("", message, context));
   }
 }
killedBy: logger.js Logging functions (debug, info, warn, error) error() should log when minLevel is error or lower
statusReason: expected "error" to be called with arguments: [ StringContaining{…} ]

Received: 

  1st error call:

  [
-   StringContaining "[ERROR] Test error message",

[Killed] BlockStatement
src/lib/logger.js:120:43
  * @param {string} scope - Logger scope name
  * @returns {Object} - Scoped logger object
  */
-export function createScopedLogger(scope) {
-  return {
-    debug: (message, context = {}) => debug(message, { ...context, scope }),
-    info: (message, context = {}) => info(message, { ...context, scope }),
-    warn: (message, context = {}) => warn(message, { ...context, scope }),
-    error: (message, context = {}) => error(message, { ...context, scope })
-  };
-}
+export function createScopedLogger(scope) {}
 
 // Default logger instance
killedBy: Worker Timestamp Logic checkAllDOIs timestamp updates Scenario 1: New DOI, successful check
statusReason: Cannot read properties of undefined (reading 'error')

[Killed] ObjectLiteral
src/lib/logger.js:121:10
  * @returns {Object} - Scoped logger object
  */
 export function createScopedLogger(scope) {
-  return {
-    debug: (message, context = {}) => debug(message, { ...context, scope }),
-    info: (message, context = {}) => info(message, { ...context, scope }),
-    warn: (message, context = {}) => warn(message, { ...context, scope }),
-    error: (message, context = {}) => error(message, { ...context, scope })
-  };
+  return {};
 }
 
killedBy: Worker Timestamp Logic checkAllDOIs timestamp updates Scenario 1: New DOI, successful check
statusReason: scheduledLogger.error is not a function

[Killed] ArrowFunction
src/lib/logger.js:122:12
  */
 export function createScopedLogger(scope) {
   return {
-    debug: (message, context = {}) => debug(message, { ...context, scope }),
+    debug: () => undefined,
     info: (message, context = {}) => info(message, { ...context, scope }),
     warn: (message, context = {}) => warn(message, { ...context, scope }),
killedBy: logger.js createScopedLogger scoped debug() should log with scope in context
statusReason: expected "debug" to be called with arguments: [ StringContaining{…} ]

Number of calls: 0

[Killed] ObjectLiteral
src/lib/logger.js:122:54
  */
 export function createScopedLogger(scope) {
   return {
-    debug: (message, context = {}) => debug(message, { ...context, scope }),
+    debug: (message, context = {}) => debug(message, {}),
     info: (message, context = {}) => info(message, { ...context, scope }),
     warn: (message, context = {}) => warn(message, { ...context, scope }),
killedBy: logger.js createScopedLogger scoped debug() should log with scope in context
statusReason: expected "debug" to be called with arguments: [ StringContaining{…} ]

Received: 

  1st debug call:

  [
-   StringContaining "[DEBUG] Scoped debug message - {\"scope\":\"TestScope\"}",

[Killed] ArrowFunction
src/lib/logger.js:123:11
 export function createScopedLogger(scope) {
   return {
     debug: (message, context = {}) => debug(message, { ...context, scope }),
-    info: (message, context = {}) => info(message, { ...context, scope }),
+    info: () => undefined,
     warn: (message, context = {}) => warn(message, { ...context, scope }),
     error: (message, context = {}) => error(message, { ...context, scope })
killedBy: logger.js createScopedLogger scoped info() should log with scope in context
statusReason: expected "info" to be called with arguments: [ StringContaining{…} ]

Number of calls: 0

[Killed] ObjectLiteral
src/lib/logger.js:123:52
 export function createScopedLogger(scope) {
   return {
     debug: (message, context = {}) => debug(message, { ...context, scope }),
-    info: (message, context = {}) => info(message, { ...context, scope }),
+    info: (message, context = {}) => info(message, {}),
     warn: (message, context = {}) => warn(message, { ...context, scope }),
     error: (message, context = {}) => error(message, { ...context, scope })
killedBy: logger.js createScopedLogger scoped info() should log with scope in context
statusReason: expected "info" to be called with arguments: [ StringContaining{…} ]

Received: 

  1st info call:

  [
-   StringContaining "[INFO] Scoped info message - {\"scope\":\"TestScope\"}",

[Killed] ArrowFunction
src/lib/logger.js:124:11
   return {
     debug: (message, context = {}) => debug(message, { ...context, scope }),
     info: (message, context = {}) => info(message, { ...context, scope }),
-    warn: (message, context = {}) => warn(message, { ...context, scope }),
+    warn: () => undefined,
     error: (message, context = {}) => error(message, { ...context, scope })
   };
killedBy: logger.js createScopedLogger scoped warn() should log with scope in context
statusReason: expected "warn" to be called with arguments: [ StringContaining{…} ]

Number of calls: 0

[Killed] ObjectLiteral
src/lib/logger.js:124:52
   return {
     debug: (message, context = {}) => debug(message, { ...context, scope }),
     info: (message, context = {}) => info(message, { ...context, scope }),
-    warn: (message, context = {}) => warn(message, { ...context, scope }),
+    warn: (message, context = {}) => warn(message, {}),
     error: (message, context = {}) => error(message, { ...context, scope })
   };
killedBy: logger.js createScopedLogger scoped warn() should log with scope in context
statusReason: expected "warn" to be called with arguments: [ StringContaining{…} ]

Received: 

  1st warn call:

  [
-   StringContaining "[WARN] Scoped warn message - {\"scope\":\"TestScope\"}",

[Killed] ArrowFunction
src/lib/logger.js:125:12
     debug: (message, context = {}) => debug(message, { ...context, scope }),
     info: (message, context = {}) => info(message, { ...context, scope }),
     warn: (message, context = {}) => warn(message, { ...context, scope }),
-    error: (message, context = {}) => error(message, { ...context, scope })
+    error: () => undefined
   };
 }
killedBy: logger.js createScopedLogger scoped error() should log with scope in context
statusReason: expected "error" to be called with arguments: [ StringContaining{…} ]

Number of calls: 0

[Survived] ObjectLiteral
src/lib/logger.js:130:16
 }
 
 // Default logger instance
-export default {
-  configure,
-  debug,
-  info,
-  warn,
-  error,
-  createScopedLogger
-};
+export default {};
